Repository: Bombe/hyphanet-website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: ru, zh_tw

source: ### Manifests A manifest contains metadata over the list of blocks a CHK is divided into and some information about the content-type(MIME), the filenames and other useful information. The main information is whether the CHK-key is a splitfile or not, and whether the manifest is chained or not. You don't need to know much about manifests in order to use Freenet, since it is a part that is handled internally.
zh_tw: ### Manifest Manifest 包含了 CHK 分塊列表的元數據、一些 MIME 內容類型（Content Type）的信息、文件名和其他一些有用的信息。主要的信息是某個 CHK 鍵值是否為分割文件，Mainfest 是否鏈接。您不需要對 Mainfest 了解太多，因為它只用在內部處理。

source: Social
zh_tw: 社交

source: Freenet provides the foundation for anonymous email, forums and chat, as well as a replacement for Facebook/Twitter. Setup of these is described in the [Freenet Social Networking Guide](http://freesocial.draketo.de/) which can also be accessed [over Freenet](http://127.0.0.1:8888/USK@t5zaONbYd5DvGNNSokVnDCdrIEytn9U5SSD~pYF0RTE,guWyS9aCMcywU5PFBrKsMiXs7LzwKfQlGSRi17fpffc,AQACAAE/fsng/58/).
zh_tw: Freenet 提供了匿名 Email、論壇和聊天工具，也提供了類似 Facebook/Twitter 的社交網絡。您可以在《[Freenet 社交網絡指南](http://freesocial.draketo.de/)》一文了解到詳細的設置方法。此文也可以[在 Freenet 中訪問](http://127.0.0.1:8888/USK@t5zaONbYd5DvGNNSokVnDCdrIEytn9U5SSD~pYF0RTE,guWyS9aCMcywU5PFBrKsMiXs7LzwKfQlGSRi17fpffc,AQACAAE/fsng/58/)。

source: jSite is a graphical application that you can use to create, insert and manage your own Freenet sites. It was written in Java by Bombe. You can [download jSite here](https://downloads.freenetproject.org/alpha/jSite/jSite.jar)
zh_tw: jSite 是一個圖形應用程序，它可以幫助你創建、插入和管理自己的 Freenet 網站。它由 Bombe 使用 Java 撰寫。 您可以[在這里下載 jSite](https://downloads.freenetproject.org/alpha/jSite/jSite.jar)。

source: ### Starting jSite To start jSite, type the following in a terminal: <pre> java -jar jSite.jar</pre> The first window you see is this: ![](assets/img/jsite/select-project.png) In the pane to the left, already created projects can be selected for updating, deleting or cloning. Since this is the first start, no such projects exist.
zh_tw: ### 啟動 jSite 要啟動 jSite，在終端命令行提示符下輸入如下命令： <pre> java -jar jSite.jar</pre> 啟動后您看到的第一個窗口如下圖： ![](assets/img/jsite/select-project.png) 窗口左側列出了已經創建的項目，您可以選中它，進行更新、刪除或復制操作。因為這是您第一次啟動 jSite，還沒有項目，所以這里是空的。

source: ### Creating a Freesite To create a new Freesite, you click the **Add project**-button. You then need to fill in the details of the project. Under the Project information-section: * **Name** - this is just a name for you to know the project, so anything will do. It may contain spaces. * **Description** - again, just a slightly longer description of the project for your own convenience. * **Local Path** - This is a directory where you will store all the pages of the freesite you are creating. Put in the full path. You can click the Browse button to select a directory graphically or just type it in.
zh_tw: ### 創建一個 Freesite 要創建一個新的 Freesite，您可以點擊“**Add project**”按鈕。然后您需要輸入項目的詳細信息。在項目信息欄目： * **Name** - 這里您可以輸入項目的名稱，無限制。可以包含空格。 * **Description** - 這里您可以輸入項目的描述。僅供您自己參考。 * **Local Path** - 這里您需要選擇您的 Freesite 頁面所在的目錄。

source: Under the Address-section, there are some automatically generated entries, and the human readable name for the site, as seen in the address-field of the browser: * **Request URI** - this is filled in automatically and should be a long string of seemingly random characters. * **Insert URI** - this is also filled in automatically and will look similar to the Request URI. * **Path** - You need to enter a single word here without spaces. This will appear at the end of the address of your site. You can't leave this blank. Below is an example of how it might look: ![](assets/img/jsite/project-details.png) When everything is filled in correctly, you may press **Next**.
zh_tw: 在 Address 欄，有自動生成的地址，以及便於人記憶的網站名稱。您在瀏覽器的地址欄會看到相同的網址： * **Request URI** - 此欄目會自動填充，是一個長隨機字符串。 * **Insert URI** - 此欄目會自動填充，看上去和上面的 Request URI 類似。 * **Path** - 您需要在這里輸入一個單詞，不能有空格。它會附在您網站的網址最后。此欄目必填。 下面的截圖是一個示例： ![](assets/img/jsite/project-details.png) When everything is filled in correctly, you may press **Next**.

source: The next step is to add files to your Freenet site (or Freesite). This is done in the dialog called **Project Files**. Since we have no files in the current directory, yet, the dialog is pretty much empty. ![](assets/img/jsite/project-files.png) To add files, we put some files in the local directory we specified earlier, **/home/test**, and press **Re-scan**. Then, presto, the files appear. ![](assets/img/jsite/default-file.png) We then highlight one of these files that will be the default page (e.g. index.html might be a good choice) and check the **Default file** checkbox. It should recognise the MIME type as text/html, so leave everything else as they are and click the **Insert now** button.
zh_tw: 下一步是添加您的 Freenet 網站（Freesite）文件。您可以在 **Project Files** 對話框添加文件。因為我們在當前目錄還沒用文件，此對話框是空的。 ![](assets/img/jsite/project-files.png) 要添加文件，我們可以將一些文件放到我們之前指定的目錄“**/home/test**”，然后點擊“**Re-scan**”按鈕。然后文件就會出現。 ![](assets/img/jsite/default-file.png) 之后我們選中其中一個文件作為頁面（例如，您可以選擇 index.html），并選中“**Default file**”復選框。它的 MIME 類型應當被識別為 text/html。您可以暫時不用了解其他的選項，直接點擊“**Insert now**”按鈕。

source: If all goes well, a window like the one below should appear. It may take quite a while to insert the Freesite, several minutes in fact. ![](assets/img/jsite/project-insert.png) When all is finished, you will get a message pop-up that tells you that the site has been inserted successfully. You can copy the URI to the clip-board by clicking the **Copy URI to Clipboard** -button.
zh_tw: 如果一切正常，下面的窗口會出現。插入一個 Freesite 可能需要數分鐘的時間。 ![](assets/img/jsite/project-insert.png) 當一切完成時，您會看到一個彈出消息，告訴您網站已經被成功插入。您可以點擊“**Copy URI to Clipboard**”按鈕將網址復制到剪貼板。

source: Then you can use FProxy to surf to your newly created Freesite. Just paste the URI after the [http://localhost:8888/](http://localhost:8888/) in the browser address bar, like this (cut for screen purposes): <pre> http://localhost:8888/freenet:USK@cJNO6G0[..]joM,AQACAAE/watergate2/1/</pre> If it works, congratulations, you have just created your first Freesite!
zh_tw: 接下來您可以使用 FProxy 瀏覽您剛剛插入的 Freesite。只要在瀏覽器地址欄中將網址粘貼到 [http://localhost:8888/](http://localhost:8888/) 之后，如下（截短以適配頁面寬度）： <pre> http://localhost:8888/freenet:USK@cJNO6G0[..]joM,AQACAAE/watergate2/1/</pre> 如果您可以訪問網站，那么祝賀您成功創建了您的第一個 Freesite！

source: Donate
ru: Пожертвование
zh_tw: 捐款

source: Become a member
zh_tw: 成為成員

source: Make a donation
zh_tw: 捐款

source: Choose your monthly donation:
zh_tw: 選擇你要每月捐款：

source: Choose your one-time donation:
zh_tw: 選擇你要一次性捐款：

source: Or set your own amount:
zh_tw: 或者自己設置金額：

source: Custom amount
zh_tw: 自定義金額

source: #### How can I donate? * You can donate using PayPal. For a recurring payment of $5 or more per month you can become a Freenet "member" (this requires a [PayPal][url_paypal] account). Recurring donations give the project a more stable and dependable income which makes it easier to make long-term commitments to potential developers. Alternatively you can make a one-time donation.
zh_tw: ####我該如何捐款？ * 您可以通過PayPal給我們捐款。如果每月捐款$5或更多，您將成為一位Freenet「會員」（這需要一個 [PayPal][url_paypal] 賬戶）。 週期性的捐款能給予我們穩定和可靠的的資金來源，這能幫助我們更加輕鬆的對那些潛在的開發者進行長期委託。 同時您也可以選擇一次性的捐贈。

source: * ![][logo_bitcoin] You can donate using [Bitcoin][url_bitcoin]. Send your donations to {bitcoin_address}. * You can also donate by purchasing items from the Freenet [store][url_zazzle_store]. * Or support us via [Salt at Bountysource][url_salt_bountysource]. * Alternatively, please contact us at {donate_email} if you cannot use any of these payment methods.
zh_tw: * ![][logo_bitcoin] 您也能選擇通過[比特幣Bitcoin][url_bitcoin] 來向我們捐贈。 把您的捐款傳送至:{bitcoin_address} *您也能通過購買我們的產品來幫助我們。 [傳送門][url_zazzle_store] *亦或是從 [這裡][url_salt_bountysource] 支援 *同樣的，如果您無法使用上述方式，可以直接與 {donate_email} 聯絡。

source: The Freenet Non-Profit
zh_tw: Freenet 非營利

source: All donations go to The Freenet Project Inc, a 501(c)(3) non-profit organization with the following mission statement: > The specific purpose of this corporation is to assist in developing and > disseminating technological solutions to further the open and democratic > distribution of information over the Internet or its successor electronic > communication networks or organizations. It is also the purpose of this > organization to guarantee consenting individuals the free, unmediated, > and unimpeded reception and impartation of all intellectual, scientific, > literary, social, artistic, creative, human rights, and cultural > expressions, opinions and ideas without interference or limitation by or > service to state, private, or special interests. It is also the purpose of > this organization to educate the world community and be an advocate of > these purposes. All funds received will only be utilized to advance our Mission Statement, and are administered at the direction of the Freenet Project Board. The Freenet Project Inc is registered under EIN `95-4864038`
zh_tw: 所有捐款將歸於Freenet Project Inc 名下,它是一個 501(c)(3) 非營利組織,並遵循以下使命宗旨: > 本公司旨在協助特定目的的技術開發 > 與推廣科技解決方案以促進開放與民主 > 的網路與電子通訊資訊傳播 > 本公司也致力於各組織與網路 > 的自由,確保個體可以直接,無障礙 > 無偏倚地從事智性,科學,文學,社會,藝術,創作, > 人權與文化表達,意見與想發交流 > 不受國家或任何私人與特定利益的干預與威脅 > 本機構負有教育社群之任務,以推廣以上之目標. 所有的收到的基金將專用於符合以上宗旨的活動,以及專案理事會的行政開支. Freenet Project Inc 註皿在 EIN `95-4864038`之下

source: Why donate
zh_tw: 為何捐款

source: Sponsors
zh_tw: 贊助者

source: The following persons, organisations and companies have generously sponsored this project through donations or discounts on hardware and services:
zh_tw: 以下這些人員，組織以及公司企業提供了熱心地贊助 本專案接受了以下的捐款以及他們在軟體與硬體的折扣或捐贈

source: * [John Pozadzides][url_john_pozadzides] John is the founder of HTMLHelp.com and former Vice President of Sales for SAVVIS Communications. John has donated $10,000 to the Freenet Project to fund ongoing development of the Freenet software.
zh_tw: * [John Pozadzides][url_john_pozadzides] John 是HTMLHelp.com的創辦人，也是for SAVVIS Communications的前營業部副總裁。 他捐助了 $10,000美元給 Freenet 專案以及相關進行中的軟體開發。

source: * [Web Hosting Search][url_web_hosting_search] WebHostingSearch is a top rated guide to various world wide web hosting companies. Mr Chris Reynolds and the friendly team behind this company have become one of our proud promoters.
zh_tw: * [Web Hosting Search][url_web_hosting_search] WebHostingSearch是網頁主機服務的頂級提供者 Chris Reynold以及他領導的友善團隊是我們最有力的推廣者。

source: * [John Gilmore][url_john_gilmore] John Gilmore is one of the founders of the Electronic Frontier Foundation, the Cypherpunks mailing list, and Cygnus Solutions. He created the alt.* hierarchy in Usenet and is a major contributor to the GNU project. He has donated $10,000.
zh_tw: * [John Gilmore][url_john_gilmore] John Gilmore 是電子前沿基金會,Cypherpunks郵件群以及Cygnus Solutions等社群的創辦人之一。 他在Usenet 開啟了alt.* 的架構，也是GNU專案的主要貢獻者。 他也捐助了 $10,000美元

source: * [Bytemark Hosting][url_bytemark_hosting] Bytemark provides discounted hosting facilities to Freenet and comes with our highest recommendation.
zh_tw: * [Bytemark Hosting][url_bytemark_hosting] Bytemark 給予Freenet服務器主機設備優惠,我們高度推崇他們的服務。

source: * [zoozle Torrent Search][url_zoozle] zoozle is a search engine for BitTorrent and P2P networks. It is also available in [german][url_zoozle_german] and [french][url_zoozle_french]. They have donated $1,500.
zh_tw: * [zoozle Torrent Search][url_zoozle] zoozle是提供BT與P2P網路的搜尋引擎 它另有[德語][url_zoozle_german] 和 [法語][url_zoozle_french]服務 他們捐助了$1,500美元

source: * [YourKit, LLC][url_yourkit] YourKit is kindly supporting Freenet by providing us a free of charge license of its full-featured Java Profiler. YourKit, LLC is the creator of innovative and intelligent tools for profiling Java applications. You can learn more about [YourKit Java Profiler][url_yourkit_profiler] following the link.
zh_tw: * [YourKit, LLC][url_yourkit] YourKit 提供了 Freenet 免費使用Java Profiler 完整功能的許可 YourKit, LLC是一個使用Java 應用軟體資料來做創新與情報工具的開發商，你可以在以下連結中找到更多介紹 [YourKit Java Profiler][url_yourkit_profiler]

source: * [Google][url_google] Google [open source][url_google_opensource] have three times donated $18,000, as well as paying for students to work with us over summer since 2006 through the [Google Summer of Code][url_google_soc] program.
zh_tw: * [Google][url_google] Google [開源][url_google_opensource]三次各捐贈了 18,000美元，此外2006年起補助學生參與[Google Summer of Code][url_google_soc]幫助我們。

source: * [Finanzvergleich][url_finanzvergleich] Finanzvergleich is a German financial services comparison site, who have contributed $1,500.
zh_tw: * [Finanzvergleich][url_finanzvergleich] Finanzvergleich是一家德國財務比較網站，它們捐助了$1,500美元

source: * [TopDir][url_topdir] TopDir is a human edited web directory with informations about interesting topics and websites in the German language.
zh_tw: * [TopDir][url_topdir] TopDir 是一個人工編輯網站目錄，提供德文世界裏有趣的標題和網站資訊

source: * [All Filters][url_allfilters] - another generous sponsor.
zh_tw: * [All Filters][url_allfilters] - 慷慨贊助者.

source: * [A German Site for Gardening and Plants][url_gartenheinz] - another generous sponsor.
zh_tw: * [某德國園藝網站][url_gartenheinz] - 慷慨贊助者。

source: * [Simple Car Rentals][url_simple_carrentals] Simple Car Rentals has generously supported Freenet by helping us with some of our administrative expenses over the years.
zh_tw: * [Simple Car Rentals][url_simple_carrentals] Simple Car Rentals 熱心地贊助Freenet，幫助我們負擔年的行政支出。

source: * [The Sports Den][url_sportsden] The Sports Den has a wide variety of outdoor sports equipment, they are based in Ireland but can ship to the UK, Europe, and the United States.
zh_tw: * [The Sports Den][url_sportsden] The Sports Den 是一家多樣戶外運動用品公司，他們位於愛爾蘭也提供商品運送到英國／美國的服務

source: * ![][logo_intellij_idea] [JetBrains][url_jetbrains] has kindly provided a license for the Ultimate edition of [IntelliJ IDEA][url_intellij_idea].
zh_tw: * ![][logo_intellij_idea] [JetBrains][url_jetbrains] 親切地提供了無限次使用 [IntelliJ IDEA][url_intellij_idea]的許可.

source: Freenet Project Inc does not necessarily endorse the business activities of all of the companies listed on this page. Donation inquiries please contact Ian Clarke: {donate_email}
zh_tw: Freenet不必然為以上這些企業的行為和商業活動背書 有關捐款的詢問，可聯絡 Ian Clarke: {donate_email}

source: Store
zh_tw: 存儲

source: Thanks for your donation!
zh_tw: 感謝您的捐款！

source: We have received your generous donation. It will be used at the direction of the Freenet Board to advance the interests of the Freenet Project. If you have any questions about how your donation will be used please contact Ian Clarke: {donate_email}.
zh_tw: 我們已收到你慷慨的捐款。它將用董事會 促進Freenet專案利益的方向上。如果你 對你的捐款有任何問題，請聯絡 Ian Clarke: {donate_email}.

source: Thanks
zh_tw: 感謝

source: Download
ru: Загрузить
zh_tw: 下載

source: To access Freenet, you first need to install the main application. Freenet will run in the background and you can use your browser to change settings and access content. There are other applications that you can install at a later time to add more functionality. Steps: * [Download and install Freenet][autostart] * [Add friends (or connect to strangers)][add_friends] * [Start using Freenet!][usage]
zh_tw: 您需要首先安裝主應用程式來訪問Freenet。 Freenet會在後臺執行，您可以通過您自己愛用的網頁瀏覽器變更設定和訪問Freenet。 也有許多其他程式能使Freenet如虎添翼，在這之後看看吧! 步驟: * [下載和安裝Freenet][autostart] * [新增朋友 (或連線到陌生人)][add_friends] * [開始使用Freenet!][usage]

source: Show installation instructions for:
zh_tw: 顥示安裝指示給:

source: *Freenet is free and open source software available under GPLv2+. The source code is on [GitHub][github_freenet].*
zh_tw: *Freenet 是在GPLv2+之下的免費開源軟體。源碼在[GitHub][github_freenet].*

source: ### Windows Download and run [the installer](assets/jnlp/FreenetInstaller.exe)
zh_tw: ### Windows 下載並執行[安裝程式](assets/jnlp/FreenetInstaller.exe)

source: Download Freenet
zh_tw: 下載 Freenet

source: ([try this if the first link is blocked](https://downloads.freenetproject.org/latest/FreenetInstaller.exe)) ([gpg signature][url_gpg_sig]; [keyring][url_keyring]) It will automatically install Freenet and other required components for you. When done, your default browser will automatically open up to Freenet's web-based user interface. ![](assets/img/install/1-langselect-windows.png) Freenet requires Windows XP or later.
zh_tw: （如果第一個連結無法下載，試試[這個連結](https://downloads.freenetproject.org/latest/FreenetInstaller.exe)。）（([GPG 簽名][url_gpg_sig]；[鑰匙串][url_keyring]） 安裝程式將自動為您安裝 Freenet 和其他必需的元件。安裝完成後，您的預設瀏覽器將自動開啟 Freenet 的網頁介面。 ![](assets/img/install/1-langselect-windows.png) Freenet 需要 Windows XP 或更高版本。

source: ### OS X Download and run [the installer][url_mac_installer] ([gpg signature][url_gpg_sig]; [keyring][url_keyring]).
zh_tw: ### OS X 下載並執行[安裝程式][url_mac_installer]（[GPG 簽名][url_gpg_sig]；[鑰匙串][url_keyring]）。

source: Download Freenet for OSX
zh_tw: 下載 OSX 版 Freenet

source: It will automatically install Freenet and other required components for you. When done, your default browser will automatically open up to Freenet's web-based user interface. ![](assets/img/mactray/osx_installer_step2_transparent.png) Freenet requires OS X 10.8 or later.
zh_tw: 它會自動為您安裝 Freenet 及其相依元件。安裝完成後，您的預設瀏覽器會自動開啟 Freeent 的網頁介面。 ![](assets/img/mactray/osx_installer_step2_transparent.png) Freenet 需要 OS X 10.8 或更高版本。

source: ### GNU/Linux & POSIX Try the [Java Web Start installer](assets/jnlp/freenet.jnlp).
zh_tw: ### GNU/Linux & POSIX 試試用[Java Web Start 安裝](assets/jnlp/freenet.jnlp)。

source: Install Freenet
ru: Установка Freenet
zh_tw: 安裝 Freenet

source: Now follow the installer: ![](assets/img/install/1-langselect.png) If it doesn't work: You need to have a recent **Java Runtime Environment** (JRE). We have experienced best results with Oracle's Java Runtime Environment which can be obtained via your [package manager]( https://en.wikipedia.org/wiki/Package_manager) or from [ http://www.java.com/](http://www.java.com/). Java version {java_required} or higher is required, and version {java_recommended} or higher is strongly recommended. You should keep Java up to date to avoid problems and for better performance. Open a terminal and run:
zh_tw: 現在照安裝器說的做： ![](assets/img/install/1-langselect.png) 如果執行不了： 您需要安裝較新的的 **Java 執行環境** (JRE)。我們感覺 Oracle 的 JRE 最好使，您可以通過您的[套件管理器]( https://zh.wikipedia.org/wiki/包管理器) 或 [http://www.java.com/](http://www.java.com/) 免費下載安裝。 Java 最低版本要求為 {java_required}。推薦使用 {java_recommended} 或更高版本。您應當經常升級 Java，以避免問題和提高效能。 開啟主控臺執行：

source: Alternatively, downloading [the installer](assets/jnlp/freenet_installer.jar) ([gpg signature][jar_sig]; [keyring][url_keyring]) and then clicking on the file may work on some systems, but if there are problems we recommend the above command lines. If wget is not installed, it can be installed with a package manager, such as sudo apt-get install wget on Debian or Ubuntu. If the link above is blocked, you could download it from our server [here](https://downloads.freenetproject.org/latest/new_installer_offline.jar). But please use the other link if you can. **Note**: Many GNU/Linux distributions no longer ship with Java Web Start enabled. We would like to make distribution packages for easier installation, and have an in-development (and not maintained) [Debian package]( https://github.com/freenet/debian), but haven't gotten it stable or made official ones for other distributions. If you are a developer and would like to join us and help it would be much appreciated! If this doesn't work on a headless server, try "java -jar new_installer_offline.jar -console", and follow the prompts to tell it where to install Freenet etc.
zh_tw: 另外，您還可以[下載安裝程序](assets/jnlp/freenet_installer.jar) ([gpg signature][jar_sig])，并雙擊它來安裝。不過在有些系統這種方式可能不起作用，這時我們推荐您嘗試上面的命令。如果沒有安裝 wget，您可以通過系統的軟件包管理器來安裝，如 Debian 或 Ubuntu 可以使用命令：sudo apt-get install wget。 如果上面的下載鏈接被封，您可以[點擊這里](https://downloads.freenetproject.org/latest/new_installer_offline.jar)從我們的服務器直接下載。不過因為流量和頻寬的原因，盡可能不要使用這個鏈接。 **注意：** 許多 GNU/Linux 的發行版不再啟用 Java Web Start。我們想制作一個更容易安裝的軟件包，并且已經有一個正在開發的（目前已沒有人維護）[Debian 軟件包]( https://github.com/freenet/debian)，但是目前還不穩定，也不支持其他類型的發行版。如果您是個開發者，願意加入并協助我們完成這個任務，不甚感激！ 上述方式如果不能在無外設服務器上正常工作，您可以使用命令 "java -jar new_installer_offline.jar -console"，并根據提示安裝 Freenet。

source: ### Mirrored installation If you have a working Freenet installation directory that you have mirrored from one Unix machine to another (e.g. via rsync or unison), enabling the mirrored installation is not difficult. Nothing in a Freenet installation cares about its host's IP address; it can't, or Freenet would fail on machines that get IP addresses from a DHCP pool. All you actually need to do is tell the system you've mirrored to that it should start the Freenet proxy daemon for you on boot. Do `crontab -l` on the source machine, find the line that is tagged "FREENET AUTOSTART" and add that to your crontab on the mirrored machine. However: each installation has a unique identity key generated at installation time. If you try to run two instances with the same identity _at the same time_, both proxy demons will become confused and upset. Don't do this!
zh_tw: ### 鏡像安裝 如果您的 Freenet 安裝目錄是從其他 Unix 電腦鏡像過來的（例如：通過 rsync 或 unison），啟用鏡像安裝很簡單。Freenet 的任何部分都不依賴於其主機 IP 地址；否則，如果主機是從 DHCP 獲取的動態 IP，Freenet 就會無法正常運行。 您只要告訴存放鏡像的系統，應該在啟動時自動啟動 Freenet 代理服務。在源系統使用 `crontab -l`，找到標記有「FREENET AUTOSTART”的一行，將它添加到鏡像系統的 crontab 中。 但是每個 Freenet 節點有一個唯一的身份鍵值，是安裝時自動生成的。如果您的兩個節點_同時_使用同一個身份鍵值，兩個代理服務會互相干擾運行異常。請別這様做！

source: Using Freenet
zh_tw: 使用Freenet

source: Please try the [step by step guide][url_freesocial] to setting up Freenet and various Freenet apps, especially if installing on OS X. We are not responsible for unofficial third party apps it recommends (including FMS), but many Freenet users and developers use them.
zh_tw: 這里有一篇[指南](http://freesocial.draketo.de/)可以手把手教您如何設置 Freenet 以及各種運行在 Freenet 上的 App。 強烈建議您閱讀！如果您恰好使用蘋果的 OS X 操作系統，那么更要看一下了。我們對此文中推荐的的第三方 App 無法提供技術支持（包括 FMS）， 但是很多 Freenet 用戶和開發者都使用它們。

source: ### Firewalls and routers Freenet should work fine with most routers, but if you are having problems and you have a firewall or router, click [**here**](help.html#firewall) for some info.
zh_tw: ### 防火牆和路由 Freenet 應該能在大多數路由器后正常工作，但是如果您遇到問題，并且您的節點在防火牆或路由后，[**點擊這里**](help.html#firewall)以了解更多信息。
