Repository: Bombe/hyphanet-website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: ru, zh_tw

source: What is Freenet?
ru: Что такое Freenet?
zh_tw: 什麼是 Freenet？

source: > _"I worry about my child and the Internet all the time, even though she's too > young to have logged on yet. Here's what I worry about. I worry that 10 or > 15 years from now, she will come to me and say 'Daddy, where were you when > they took freedom of the press away from the Internet?'"_ > --Mike Godwin, [Electronic Frontier Foundation](https://www.eff.org/)
zh_tw: > 「我一直擔心我的孩子與網路，盡管她還年輕得沒有上過網。我擔心的是 10 年或 15 年之后，她會來問我：『老爸，當年他們從網絡奪走新聞自由的時候，你去哪了？』」 > ——Mike Godwin，[電子前哨基金會](https://www.eff.org/)

source: Freenet is free software which lets you anonymously share files, browse and publish "freesites" (web sites accessible only through Freenet) and chat on forums, without fear of censorship. Freenet is decentralised to make it less vulnerable to attack, and if used in "darknet" mode, where users only connect to their friends, is very difficult to detect.
ru: Freenet - это бесплатное программное обеспечение, которое позволяет анонимно обмениваться файлами, просматривать и публиковать "фрисайты" (веб-сайты, доступные только через Freenet) и общаться на форумах, не опасаясь цензуры. Freenet децентрализован для того, чтобы сделать его менее уязвимым к атакам. При использовании Freenet в режиме "darknet", когда пользователи подключаются только к своим друзьям, их очень трудно обнаружить.
zh_tw: Freenet 是一個免費軟件，您可以通過它匿名的分享文件、瀏覽和發布「Freesite」（只能在 Freenet 網絡中訪問的網站）、在論壇中發帖，不用擔心被審查。Freenet 是去中心化的，很難被攻擊。如果使用它的「暗網(Darknet)」模式，用戶僅會連接到他們的好友，他人很難偵測到這個用戶。

source: Communications by Freenet nodes are encrypted and are routed through other nodes to make it extremely difficult to determine who is requesting the information and what its content is.
ru: Общение между нодами (узлами) Freenet зашифровано и маршрутизируется через другие ноды, чтобы было крайне сложно установить кто запрашивает информацию и какой у нее контент.
zh_tw: Freenet 節點之間的通訊是加密的，並通過其他節點路由。因此要了解誰在請求某些信息、請求的內容是什麼，是極其困難的。

source: Users contribute to the network by giving bandwidth and a portion of their hard drive (called the "data store") for storing files. Files are automatically kept or deleted depending on how popular they are, with the least popular being discarded to make way for newer or more popular content. Files are encrypted, so generally the user cannot easily discover what is in his datastore, and hopefully can't be held accountable for it. Chat forums, websites, and search functionality, are all built on top of this distributed data store.
ru: Пользователи вносят свой вклад в сеть, предоставляя часть пропускной способности своего интернет-соединения и часть своего жесткого диска (так называемое "хранилище данных") для хранения файлов. Файлы автоматически сохраняются в сети или удаляются из нее в зависимости от их популярности: наименее популярные выбрасываются, чтобы освободить место для нового или более популярного контента. Файлы зашифрованы, поэтому пользователь, как правило, не знает что именно находится в хранилище данных на его компьютере, и, мы надеемся, не несет ответственность за эти данные. Чат-форумы, веб-сайты и функции поиска - все построены на основе этого распределенного хранилища данных.
zh_tw: 用戶通過貢獻自己的互聯網帶寬和他們的一部分硬槃空間（稱為「數據存儲（Data Store）”）來儲存文件。根據文件的流行程度，文件會自動被保留或刪除。不流行的文件被刪除，可以騰出更多的空間給流行的文件。文件是加密的，因此用戶無法輕易得知它的「數據存儲”內儲存了什么內容，因此也不會因其被追究責任。聊天論壇、網站和搜索功能，都是基於該分布式「數據存儲”搆建。

source: Freenet has been downloaded over 2 million times since the project started, and used for the distribution of censored information all over the world including countries such as China and in the Middle East. Ideas and concepts pioneered in Freenet have had a significant impact in the academic world. Our 2000 paper "Freenet: A Distributed Anonymous Information Storage and Retrieval System" was the most cited computer science paper of 2000 according to Citeseer, and Freenet has also inspired papers in the worlds of law and philosophy. Ian Clarke, Freenet's creator and project coordinator, was selected as one of the top 100 innovators of 2003 by MIT's Technology Review magazine.
ru: С момента начала проекта, Freenet был скачан более 2 миллионов раз и использовался для распространения цензурированной информации по всему миру, включая такие страны, как Китай и страны Ближнего Востока. Идеи и концепции, которые впервые появились именно во Freenet, оказали значительное влияние на академический мир. Наша статья 2000 года "Freenet: распределенная система анонимного хранения и поиска информации" ("Freenet: A Distributed Anonymous Information Storage and Retrieval System") была самой цитируемой статьей по информатике 2000 года по версии Citeseer. Также, Freenet вдохновил написание серии статей в области права и философии. Ян Кларк, создатель и координатор проекта Freenet, был включен в список 100 лучших новаторов 2003 года журналом MIT's Technology Review.
zh_tw: Freenet 自誕生起已被下載超過 200 萬次，用來在全世界分發敏感受審查的信息，包括中國和中東國家。Freenet 中的先驅思想和概念也深深影響了學朮界。我們在 2000 年的論文《Freenet：一個分布式匿名信息存儲和接收系統》（Freenet: A Distributed Anonymous Information Storage and Retrieval System）， 是 2000 年被引用次數最多的計算機科學論文（來源：Citeseer）。Freenet 也給世界法律和哲學論文帶來了靈感。Ian Clarke，Freenet 的創造者和項目協調人，被 2003 年《麻省理工科技評論 》雜志（MIT's Technology Review）評為世界百強革新者。

source: An important recent development, which very few other networks have, is the "darknet": By only connecting to people they trust, users can greatly reduce their vulnerability, and yet still connect to a global network through their friends' friends' friends and so on. This enables people to use Freenet even in places where Freenet may be illegal, makes it very difficult for governments to block it, and does not rely on tunneling to the "free world".
ru: Одной из важных разработок последних лет является режим "darknet" - функционал, которым могут похвастаться очень немногие сети. Подключаясь только к тем людям, кому доверяют, пользователи могут значительно снизить свою уязвимость, в то же время, сохраняя возможность подключаться к глобальной сети через своих друзей, друзей своих друзей и так далее. Это позволяет людям использовать Freenet даже в тех местах, где он может быть незаконным: поскольку Freenet не полагается на прокладывание туннеля в "свободный мир", правительствам очень сложно заблокировать его.
zh_tw: 在最近的開發中，我們引入了一個重要的功能（在其他類似網絡中鮮見），稱為「暗網（Darknet）”：用戶僅與自己信任的人互相連接，這能夠極大的降低他們的風險，同時仍然能夠通過他們朋友的朋友的朋友來連接到整個 Freenet 網絡。這能夠讓那些「使用 Freenet 即違法”的地方的人們使用 Freenet。政府很難封禁它，用戶無需「翻牆隧道”就可以進入「自由的世界”。

source: The Philosophy behind Freenet
zh_tw: Freenet 背后的哲學

source: *Written by Ian Clarke* 1. [A Disclaimer](#disclaimer) 2. [Suggested prior reading](#prior_reading) 3. [The importance of the Free flow of information](#free_flow_info) 4. [Censorship and freedom](#censor_freedom) 5. [The solution](#solution) 6. [Isn't censorship sometimes necessary?](#is_censorship_necessary) 7. [But why is anonymity necessary?](#why_anonymity) 8. [And what of copyright?](#copyright) 9. [But how will artists be rewarded for their work without copyright?](#reward) 10. [Alternatives to Copyright](#alternative)
zh_tw: *作者：Ian Clarke* 1. [免責聲明](#disclaimer) 2. [建議提前閱讀](#prior_reading) 3. [自由信息流的重要性](#free_flow_info) 4. [審查制度和自由](#censor_freedom) 5. [解決方案](#solution) 6. [有時審查制度不是必須的嗎？](#is_censorship_necessary) 7. [但是為何需要匿名？](#why_anonymity) 8. [版權又將怎樣？](#copyright) 9. [但若藝朮家的工作沒有版權，他們如何得到回報？](#reward) 10. [版權的替代品](#alternative)

source: ### 1\. A Disclaimer There are many reasons why people get involved in the Freenet Project. Some share the views outlined in this document; some share variations of these views, which are also served by what we are trying to achieve; and some just enjoy the technical challenge. These are the ideas which motivated me to architect the system in the first place, but not necessarily the views that everyone involved in the Freenet Project holds.
zh_tw: ### 1\. 免責聲明 人們參與 Freenet 項目有很多原因。有些人贊同本文的觀點；有些人有著不同的觀點，但是這些觀點同樣受我們要完成的事業支持；而另一些人僅熱衷於迎接技術方面的挑戰。上述想法驅動我最初實現了這個系統，但這些觀點不一定受所有 Freenet 項目的參與者認同。

source: ### 2\. Suggested prior reading For this document to make sense, you should probably know what Freenet is. You can get a good overview from [What is Freenet?](about.html#introduction).
zh_tw: ### 2\. 建議提前閱讀 要理解本文講述的內容，您應該事先了解什么是 Freenet。您可以先閱讀《[什么是 Freenet?](about.html#introduction)》章節，以大致了解。

source: ### 3\. The importance of the Free flow of information Freedom of speech, in most western cultures, is generally considered to be one of the most important rights any individual might have. Why is the freedom to share ideas and opinions so important? There are several ways to answer this question.
zh_tw: ### 3\. 自由信息流的重要性 言論自由，在大多數西方文化中，被普遍認為是個人最重要的權利之一。為什么自由分享想法和觀點如此重要？可以從几個方面來回答這個問題。

source: #### 3.1 Communication is what makes us human One of the most obvious differences between mankind and the rest of the animal kingdom is our ability to communicate sophisticated and abstract concepts. While we constantly discover that animal's communication ability is more sophisticated than previously assumed, it is unlikely that any other animal approaches our own level of ability in this area.
zh_tw: #### 3.1 溝通是我們之所以成為人類的原因 人類和其他動物王國最顯著的不同是我們的復雜溝通和抽象概念的能力。雖然我們現在發現動物之間的溝通其實也十分復雜，但其他動物要達到我們的溝通水平几乎是不可能的。

source: #### 3.2 Knowledge is good Most people, given the option of knowing something and not knowing something, will choose to have more information rather than less. Wars have been won and lost over who was better-informed. This is because being better-informed allows us to make better decisions, and generally improve our ability to survive and be successful.
zh_tw: #### 3.2 知識為善 大多數人對於某件事，面對「懂”與「不懂”的選擇時，都會去選擇去弄懂，了解更多信息。戰爭見多識廣的一方更可能贏。這是因為見多識廣讓我們能夠做出更好的決定，讓我們更有能力生存和成功。

source: #### 3.3 Democracy assumes a well informed population Many people today live under democratic governments, and those who don't, probably want to. Democracy is an answer to the question of how to create leaders, while preventing them from abusing that power. It achieves this by giving the population the power to regulate their government through voting, yet the ability to vote does not necessarily mean that you live in a democratic country. For a population to regulate their government effectively it must know what their government is doing, they must be well informed. It is a feedback loop, but this loop can be broken if the government has the power to control the information the population has access to.
zh_tw: #### 3.3 民主需要知情的人民 很多人今天都生活在一個民主的政權。而其他人，可能也想。民主是「如何創造領導人、且避免權力濫用”這一問題的答案。人民通過投票權來監管他們的政府，但是擁有投票權并不意味着您生活在一個民主的國家。為了有效的監管他們的政府，人民必須知道政府正在做什么。他們必須充分知情。這是一個反饋循環，但若政府有權控制人民可以掌握的信息，該循環便可被破壞。

source: ### 4\. Censorship and freedom Everyone values their freedom, in fact, many consider it so important that they will die for it. People like to think that they are free to form and hold whatever opinions they like, particularly in western countries. Consider now that someone had the ability to control the information you have access to. This would give them the ability to manipulate your opinions by hiding some facts from you, by presenting you with lies and censoring anything that contradicted those lies. This is not some Orwellian fiction, it is standard practice for most western governments to lie to their populations, so much so, that people now take it for granted, despite the fact that this undermines the very democratic principles which justify the government's existence in the first place.
zh_tw: ### 4\. 審查制度和自由 每個人都珍視他們的自由，很多人為之奮斗至終。人們認為他們應該能夠自由的形成和持有任何觀點，特別是在西方國家。假如某人有能力控制您可以掌握的信息，他們就可以對您欺騙，并審查隱藏那些可以揭穿謊言的信息，從而操控您的思想。這并不只是集權的假象，大部分西方的政府實際上就是這樣欺騙民眾的，以至於人們視之為理所當然。然而事實是這暗中破壞了民主的原則，該原則決定了此政府的存在與否。

source: ### 5\. The solution The only way to ensure that a democracy will remain effective is to ensure that the government cannot control its population's ability to share information, to communicate. So long as everything we see and hear is filtered, we are not truly free. Freenet's aim is to allow two or more people who wish to share information, to do so.
zh_tw: ### 5\. 解決方案 確保民主仍然有效的唯一方法是保證政府無法控制人民分享信息、溝通的能力。只要我們能看到和聽到的每件事都被過濾，我們不會真正的自由。Freenet 的目標就是允許願意互相分享信息的人們，能夠自由的分享。

source: ### 6\. Isn't censorship sometimes necessary? Of course no issue is black and white, and there are many who feel that censorship is a good thing in some circumstances. For example, in some European countries propagating information deemed to be racist is illegal. Governments seek to prevent people from advocating ideas which are deemed damaging to society. There are two answers to this however. The first is that you can't allow those in power to impose "good" censorship, without also enabling them to impose "bad" censorship. To impose any form of censorship a government must have the ability to monitor and thus restrict communication. There are already criticisms that the anti-racism censorship in many European countries is hampering legitimate historical analysis of events such as the second world war. The second argument is that this "good" censorship is counter-productive even when it does not leak into other areas. For example, it is generally more effective when trying to persuade someone of something to present them with the arguments against it, and then answer those arguments. Unfortunately, preventing people from being aware of the often sophisticated arguments used by racists, makes them vulnerable to those arguments when they do eventually encounter them. Of course the first argument is the stronger one, and would still hold-true even if you didn't accept the second. Basically, you either have censorship, or you don't. There is no middle-ground.
zh_tw: ### 6\. 有時審查制度不是必須的嗎？ 所有問題都不是非黑即白的，很多人都認為在某些情況下審查制度是個好東西。例如，在某些歐洲國家，傳播種族主義信息是違法的。政府尋求阻止此思想的宣揚，以免破壞社會。但對此行為有兩種爭論。首先，您不能確保當權者實施「好的”審查制度，而不實施「壞的”審查制度。要實施任何形式的審查制度，政府一定擁有監視和限制溝通的權力。在很多歐洲國家已經有對種族主義審查制度的批評，它阻止了合理的對曆史事件的分析（如第二次世界大戰）。 第二種爭論是，即使「好的”審查制度沒有滲入其他領域，它仍然會起到反作用。例如，通常來說，將爭議擺在桌面，回答這些爭議，更容易說服某人。不幸的是，雖然阻止了人們了解種族主義分子的爭議，但當他們最終遇到這些爭論時，他們會變得更加脆弱。 當然第一種爭論是最強的，即使您不接受第二種爭論，它也是正確的。根本上，要么存在審查制度，要么不存在。不存在中間的情況。

source: ### 7\. But why is anonymity necessary? You cannot have freedom of speech without the option to remain anonymous. Most censorship is retrospective, it is generally much easier to curtail free speech by punishing those who exercise it afterward, rather than preventing them from doing it in the first place. The only way to prevent this is to remain anonymous. It is a common misconception that you cannot trust anonymous information. This is not necessarily true, using digital signatures people can create a secure anonymous pseudonym which, in time, people can learn to trust. Freenet incorporates a mechanism called "subspaces" to facilitate this.
zh_tw: ### 7\. 但是為何需要匿名？ 如果您無法匿名，您不可能擁有言論自由。大部分的審查是可追溯的。在發表言論后再懲罰相關人員，比在言論發表第一時間處理更容易。唯一可避免懲罰的方式就是保持匿名。有一個常見的誤解是，匿名信息不可信。這不一定是正確的。使用數字簽名，人們可以創建一個安全的筆名，他人可以去信任這個筆名。Freenet 引入了「子空間（Subspaces）”的機制來使之成為可能。

source: ### 8\. And what of copyright? Of course much of Freenet's publicity has centered around the issue of copyright, and thus I will speak to it briefly. The core problem with copyright is that enforcement of it requires monitoring of communications, and you cannot be guaranteed free speech if someone is monitoring everything you say. This is important, most people fail to see or address this point when debating the issue of copyright, so let me make it clear: > *You cannot guarantee freedom of speech and enforce copyright law* It is for this reason that Freenet, a system designed to protect Freedom of Speech, must prevent enforcement of copyright.
zh_tw: ### 8\. 版權又將怎樣？ Freenet 的很多媒體報道都關注它帶來的版權問題，因此我在這里簡單說一下。版權的核心問題在於，為了保護版權，就需要監視通訊。如果某人監視了您所說的一切，您的言論自由就無法保障。這非常重要，在人們爭論保護版權的問題時，往往忽略了這一點。因此，我再次強調： > *您無法在保證言論自由的同時實施版權法* 這就是 Freenet——一個被設計為保護言論自由的系統——拒絕保護版權的原因。

source: ### 9\. But how will artists be rewarded for their work without copyright? Firstly, even if copyright were the only way that artists could be rewarded for their work, then I would contend that freedom is more important than having professional artists (those who claim that we would have no art do not understand creativity: people will always create, it is a compulsion, the only question is whether they can do it for a living). Secondly, it could be questioned whether copyright is effective even now. The music industry is one of the most vocally opposed to enhancements in communication technology, yet according to many of the artists who should be rewarded by copyright, it is failing to do so. Rather it has allowed middle-men to gain control over the mechanisms of distribution, to the detriment of both artists and the public.
zh_tw: ### 9\. 但若藝朮家的工作沒有版權，他們如何得到回報？ 首先，即使版權是藝朮家從其作品獲得回報的唯一方式，我主張自由比擁有專業藝朮家更重要（那些聲稱我們沒有藝朮細胞不懂得創新的人：人們總是在創新，這是種沖動，唯一的問題是他們是不是考創新生存的）。 其次，甚至到現在，版權是否起作用也是值得懷疑的。音樂產業就是一個典型的例子。在不斷提高的通訊技朮下，音樂文件得到廣泛自由的傳播，但是應當從版權得到丰厚回報的藝朮家們，并沒有。版權讓中間人控制了發行機制，同時損害了藝朮家和公眾的利益。

source: ### 10\. Alternatives to Copyright Fortunately it won't come to this. There are many alternative ways to reward artists. The simplest is voluntary payment. This is an extension of the patronage system which was frequently used to reward artists prior to copyright, where a wealthy person would fund an artist to allow them to create full-time. The Internet permits an interesting extension of this idea, where rather than having just one wealthy patron, you could have hundreds of thousands, contributing small amounts of money over the Internet. We actually practice what we preach in this regard too, on the 15th of March 2001 the Freenet Project started taking donations, and within a week we had collected over $1000.
zh_tw: ### 10\. 另一種版權 對於創作者，可以提供各種另類的獎勵方式。 最簡單的是自願性支付，它是贊助創作者在繳出作品前的 延伸，有錢者資助創作者讓他們全心全力投入工作 網路可以讓這様的方式繼續擴展 但不僅只依靠一個富有的贊助人，而是網路上成千上百位 小額的捐款人 我們真的推行這種方式，自2001年3月15日起Freenet專案開始接受捐款 而在第一週内我們就募集到 超過1000美元的捐獻。

source: People
zh_tw: 參與人員

source: ## Current Contributors
zh_tw: ## 現有貢獻者

source: ### Ian Clarke Freenet is based on Ian's paper "A Distributed Decentralised Information Storage and Retrieval System". Ian started the Freenet Project around July of 1999, and continues to coordinate the project. Learn more about Ian on his [personal website](http://blog.locut.us/).
zh_tw: ### Ian Clarke Freenet 基於 Ian 的論文《一個分布式去中心化的信息儲存和接收系統》（A Distributed Decentralised Information Storage and Retrieval System）。Ian 在 1999 年 7 月啟動了這一項目，并持續協調該項目。您可以在他的[個人網站](http://blog.locut.us/)了解 Ian。

source: ### Matthew Toseland Matthew has been working on Freenet since before the 0.5 release. His work and that of others has resulted in dramatic improvements to the performance and stability of the network.
zh_tw: ### Matthew Toseland Matthew 在 0.5 版本發布之前就在為 Freenet 工作了。他與其他人的工作顯著地提高了整個網絡的效能和穩定性。

source: ### Oskar Sandberg Oskar was also one of the earliest contributors to the Freenet Project, and has made some important theoretical breakthroughs that lead to the beginning of Freenet 0.7, see the papers page.
zh_tw: ### Oskar Sandberg Oskar 也是 Freenet 項目最早的貢獻者之一。他的理論突破是 Freenet 0.7 的基礎。參見論文頁面。

source: ### Florent Daignière Since 2003, Florent has improved various aspects of the software and performed the project's system administration. In his day job, he is the Technical Director of [Matta Consulting](https://www.trustmatta.com), a boutique security consultancy firm.
zh_tw: ### Florent Daignière 2003 年以來，Florent 改進了軟件的各個方面，同時也是項目的系統管理員。他的日常工作是 [Matta Consulting](https://www.trustmatta.com) 的技朮總監。這是一家安全咨詢公司。

source: ### Michael Rogers Michael has mostly contributed detailed simulations as part of the Google Summer of Code. He has been helpful in designing the [new transport layer]( https://old-wiki.freenetproject.org/NewTransportLayer).
zh_tw: ### Michael Rogers Michael 在 Google Summer of Code 中貢獻了詳細的模擬實驗。他的工作對設計[新的傳輸層]( https://old-wiki.freenetproject.org/NewTransportLayer)非常有幫助。

source: ### Steve Dougherty The current release manager. He joined in GSoC 2013 and has been a driving force behind tackling long standing issues in Freenet.
zh_tw: ### Steve Dougherty 目前的發佈經理。他在 2013 年的谷歌編程之夏時加入，一直以來是解決 Freenet 諸多老問題的推手。

source: ### xor The Developer of the Web of Trust and Freetalk. He worked on the Web of Trust in part-time for one year and is now working as volunteer again.
zh_tw: ### xor Web of Trust 和 Freetalk 的開發者。他為 Web of Trust 兼職工作了一年，現在再一次作為志願者工作。

source: ### David (Bombe) Roden The developer of the site insertion tool jSite and of Sone, the Social Network over Freenet.
zh_tw: ### David (Bombe) Roden 是站點插入工具 jSite 和 Freenet 社交網路 Sone 的開發者。

source: ### Ximin Luo A debian developer who currently works on packaging Freenet.
zh_tw: ### Ximin Luo 一名 debian 開發者，目前幫助打包 Freenet。

source: ### Bert Massop Works on the Freenet core and wherever there is need.
zh_tw: ### Bert Massop 從事 Freenet 核心工作，做起雜活也是個熱心腸。

source: ### TheSeeker A long term contributor who, among other things, helps keep the contact between the core developers and users in active subgroups.
zh_tw: ### TheSeeker 長期貢獻者，其擔任與核心開發人員和活躍子群組裏用戶之間的聯絡任務。

source: ### Tommy[D] A Gentoo packager who untangled all the dependencies of Freenet and packaged it cleanly in Gentoo.
zh_tw: ### Tommy[D] Linux Gentoo 的打包者，協助解開 Freenet 所有的依賴套件並將之乾淨地打包放入Gentoo發佈版本中。

source: ### Arne Babenhauserheide The current maintainer of pyFreenet and infocalypse. He also writes articles and tutorials for Freenet.
zh_tw: ### Arne Babenhauserheide pyFreenet 與 infocalypse目前主要的維護者，他也協助撰寫關於Freenet教學推廣文章。

source: ### The translators A dilligent team of people from various backgrounds who make it possible to ship Freenet and this website in many different languages.
zh_tw: ### 譯者 一個由不同背景的人組成的勤奮團隊。 使 Freenet 和這個網站以許多不同的語言展示成為可能。

source: ### Many more great hackers This list is missing many freesite authors, plugin writers, and a host of other people who contributed in various ways.
zh_tw: ### 許多偉大的駭客們 這個列表遺漏了許多 freesite 的作者、外掛編寫者和許多以其他各種方式貢獻的人。

source: ## Anonymous Contributors
zh_tw: ## 匿名貢獻者

source: ### Eleriseth Works on Freenet core and communicates via FMS.
zh_tw: ### Eleriseth 從事 Freenet 核心工作，透過 FMS 交流。

source: ### Somedude The developer of the Freenet-based Forum system FMS, of FreenetHG and of FLIP, chat over Freenet.
zh_tw: ### Somedude FMS 論壇、 FreenetHG、FLIP 的開發者。通過 Freenet 交談。

source: ## Previous Contributors
zh_tw: ## 以前的貢獻者

source: ### Thomas Markus A dutch developer and statistic-enthusiast. He now works at Topicus.Education.
zh_tw: ### Thomas Markus 荷蘭籍的程式開發者與統計狂熱份子，目前服務於Topicus.Education.

source: ### Scott Miller Scott is responsible for the implementation of much of the cryptography elements within Freenet.
zh_tw: ### Scott Miller Scott 負責實現了大部分的 Freenet 加密代碼。

source: ### Steven Starr Steven helps with administration of Freenet Project Inc, and is an advisor to the project on business and publicity matters.
zh_tw: ### Steven Starr Steven 幫助管理 Freenet Project Inc，同時也是項目的商務和媒體顧問。

source: ### Dave Baker Dave's main contribution has been [Freemail](documentation.html#freemail), his Summer of Code project to build a working email-over-Freenet system, as well as some debugging and core work in various places.
zh_tw: ### Dave Baker Dave 的主要貢獻是 [Freemail](documentation.html#freemail)。他的 Summer of Code 項目是創建一個 Freenet 中的 Email 系統，同時他也在各個方面完成了調試和核心代碼工作。

source: ### Robert Hailey Robert has helped improve the speed and security of Freenet by finding two **major** bugs, and has recently contributed some code.
zh_tw: ### Robert Hailey Robert 發現了兩個**重要** Bug，提高了 Freenet 的速度和安全性。最近他也貢獻了一些代碼。
