Repository: Bombe/hyphanet-website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: ru, zh_tw

source: I don't want my node to be used to harbor child porn, offensive content, or terrorism. What can I do?
zh_tw: 我不要讓我的節點被用於兒童色情網站,冒犯人的內容或是恐怖主義。我如何做？

source: How about encryption export restrictions?
zh_tw: 如何面對加密出口限制？

source: The Freenet Project has notified the US authorities that it will be exporting crypto. As long as your country doesn't prohibit the use of encryption you are fine. Further, there is now an exception in the export laws for software doing exactly what Freenet does! However, Oracle limits the encryption strength available on the JVM that runs Freenet; you should install the Unlimited Strength Policy Files for Java if possible to improve performance. Freenet will however work even without this, by using its built-in encryption code.
zh_tw: Freenet 項目已通知美國政府，本軟件將出口加密算法。只要你的國家沒有禁止使用加密，那么就應該沒什么問題。以及，現在對軟件的出口法律有一個例外，所以 Freenet 就在這么做！但是，Oracle 限制了 JVM 中可用的加密強度，而 Freenet 使用它運行；如果可能，你應該安裝對 Java 的無限強度策略文件，以改善性能。如果沒有這個，Freenet 仍將使用內置的加密代碼正常工作。

source: I have nothing to hide and don't need anonymity. Is there anything else Freenet can offer?
zh_tw: 我沒什么可隱瞞的，并不需要匿名。Freenet 還能提供什么？

source: Yes, in fact even without the anonymity feature Freenet is very useful because of the unique way it handles content distribution and information load. In simple terms that means you can publish a website without worrying about how big the site will be and without having to put someone else's ad banners on it. While it is unlikely that freesites will ever load faster than regular websites, they do adapt to sudden surges of visitors better ( which often happen when relatively unknown sites get linked to from a big site), and reasonable download speeds for big files are feasible too. Just don't expect very low latency.
zh_tw: 其實，不算上匿名功能的 Freenet 也非常有用，這是因為其獨特的內容分發和資訊載入方式。 簡單來說，這意味著你可以釋出一個網站，並且無需擔心網站大小，也不用放置別人的廣告橫幅。雖然 Freenet 網站永遠不可能比普通的網站載入更快，但它能更好的適應突然增加的訪問量（少有人知的網站有時會被一個大型網站連結），較大的檔案也有著合理和可行的下載速度。只是，不要期待有較低的延遲。

source: Technical
zh_tw: 技朮

source: How do I use this software? I downloaded it, but when I run it there's no GUI.
zh_tw: 我該如何使用此軟件？我下載了它，但我運行它時沒有界面。

source: Fred (the Freenet REference Daemon) runs as a daemon, or service, in the background. You normally talk to it through a Freenet client. One built-in client is fproxy, which lets you talk to Freenet with a web browser. Freenet should have installed a Browse Freenet shortcut on the desktop and/or the start menu, or a system tray icon (rabbit) with an Open Freenet menu item. Failing that, point your web browser to [http://127.0.0.1:8888/]( http://127.0.0.1:8888/) for the gateway page. Try clicking the various links in the bookmark list to reach an initial set of sites.
zh_tw: Fred（Freenet REference Daemon）執行為一個後臺程序或者服務。您通常使用 Freenet 客戶端與其交談。一個內建的客戶端是 fproxy，它讓你可以用一個網頁瀏覽器與 Freenet 溝通。Freenet 應該已經在桌面和/或開始選單安裝了一個 Freenet 的快捷方式，或者一個帶有啟動 Freenet 選單項的托盤圖示（兔子圖案）。如果以上都沒有，請使用網頁瀏覽器訪問 [http://127.0.0.1:8888/](http://127.0.0.1:8888/) 到達網關頁面。嘗試點選各個書籤連結到達各個流行的 Freenet 索引網站。

source: Why is Freenet so slow?
zh_tw: 為什么 Freenet 那么慢？

source: Is Freenet searchable?
zh_tw: Freenet 可以搜索嗎？

source: How do I get Freenet working with a Firewall/NAT?
zh_tw: 如何讓Freenet 能和防火牆/NAT一起工作?

source: Do I need a permanent Internet connection to run a node?
zh_tw: 我需要長期連網以運行節點嗎？

source: No, but it is preferred. You can run the software and test it from a "transient" connection (e.g. dial up/mobile modem), but for the network as a whole to be most useful, we will need as many permanent nodes as possible ( most cable modem or DSL setups are sufficiently "permanent" for this). A later version of Freenet may take better advantage of transient nodes.
zh_tw: 不,但它的確較好.你可以從一個暫時的連結來執行測試軟體 (例如電話接撥/行動數據機),但是對網路而言, 整體往往更為有用,因為我們盡可能地需要許多永久的節點 (大部份的有線數據機或ＤＳＬ設定就足以符合"永久") Freenet 較新版或許可以改善暫時連線節點的問題

source: Why does Freenet only download 1 or 2 files at a time?
zh_tw: 為什么 Freenet 只同時下載 1 或 2 個文件？

source: Many browsers limit the number of simultaneous connections to something far too low for efficiently browsing Freenet (since Freenet pages often have much higher latency than web pages). This can usually be reconfigured. For example, for Mozilla Firefox, type **about:config** in the address field of the browser and replace the value of the following settings to the one stated. Filter on **"connections"** to get only the relevant settings:
zh_tw: 許多瀏覧器限制了同步連結的數量,以致於大大 降低了瀏覧Freenet 的效率(畢竟延Freenet 頁面的延遲大大高於一般網頁) 這往往需要重新設定,例如火狐瀏覧器,在網址欄打入:about:config 而將以下的設定值作更改 Filter on **"connections"** to get only the relevant settings:

source: Note that these settings will cause mozilla to use more connections for all your browsing, which may not be desirable from a network congestion point of view. But you should ideally be using a separate browser for Freenet anyway, for best security.
zh_tw: 注意這些的設定將導致mozilla在瀏覧時使用更多的連線 這可能和原先預想的不一樣，會發生網路阻塞情形 為了安全起見，在使用Freenet時，你應該最好使用不同瀏覧器。

source: Why can't Freenet store data permanently?
zh_tw: 為什么 Freenet 永久存儲數據？

source: Why is Freenet implemented in Java?
zh_tw: 為什么 Freenet 用 Java 實現？

source: How do I allow connections to FProxy from other computers?
zh_tw: 我該如何允許其他電腦連接 FProxy？

source: What's new? Is there a changelog?
zh_tw: 有什么新的？有沒有更新日志？

source: Why are there so many messages in my logfile with a backtrace attached?
zh_tw: 為什么我的日志文件中有許多附有回潮信息的消息？

source: Freenet logs messages excessively during normal operation. It's something we're aware of and are working on.
zh_tw: Freenet 日志消息在正常操作期間很過量。這個情況已得知并正在研究。

source: I have Kaspersky anti-virus, and Freenet doesn't install, or shows "Download/upload queue database corrupted!"
zh_tw: 我有卡巴斯基防病毒軟件，而 Freenet 不能安裝，或者顯示「下載/上傳隊列數據庫已損壞！”

source: Kaspersky can be a problem with Freenet. See [here][url_kaspersky]. We recommend you turn off Kaspersky during install and during node startup, and exclude the directory you installed Freenet in (most likely {freenet_install_dir_1} or {freenet_install_dir_2}).
zh_tw: 卡巴斯基防毒軟體對Freenet 來說可能有點麻煩. 請見 [here][url_kaspersky]. 我們建議在安裝與節點設定過程中,先關閉卡巴斯基,並將安裝的目錄匧排除掃毒監測 (most likely {freenet_install_dir_1} or {freenet_install_dir_2}).

source: I set a password and now I forgot it, what can I do?
zh_tw: 我設置了密碼，但忘記了，怎麼辦？

source: The password protects your downloads and uploads and the client-cache (cache of what you've recently browsed on Freenet). It is stored in the file master.keys. There is no way to recover the password, but if you forget it you can wipe your downloads and uploads and the client cache by securely deleting the file master.keys. See [the question on private data and local security](#privatedata) for more information.
zh_tw: 採用密碼保護的是下載和上傳及客戶端緩存（您最近瀏覽的 Freenet 內容）。它存儲在 master.keys 文件中。沒有方法來找回密碼，但如果您忘記了密碼，您可以刪除 master.keys 文件來安全清除您的下載和上傳及客戶端緩存。參見[隱私數據和本地安全](#privatedata)了解更多信息。

source: Freenet keeps complaining about clock skew
zh_tw: Freenet 一直抱怨時鐘偏移

source: Freenet will have problems if your clock is constantly being rewound. Usually this happens when something is resetting your clock regularly in big jumps. On Linux, you should run ntpd to make sure your clock isn't too far off (this isn't vital but it's helpful), but if you see clock skew errors, try adding the -x option to it to avoid big backwards jumps. Also, running ntpdate on startup so there is one big jump before Freenet starts is a good idea. This can also happen on Windows sometimes, let us know how you managed to fix it ... generally it's not all that serious though, especially if big jumps in the clock are only once a day.
zh_tw: 如果您的時鐘經常向回走，Freenet 會出問題。這通常發生在一些定期大幅設定時鐘的情況下。在 Linux 上，您應該執行 ntpd 來確保您的時鐘沒有偏移（這不是必要的，但有用），但如果您看到時鐘偏移錯誤，嘗試新增 -x 選項來避免較大的向後跳躍。另外，在啟動時執行 ntpdate 以保證 Freenet 啟動前被糾正是個好主意。這有時也發生在 Windows 上，如果您知道怎麼解決它，讓我們知道……通常它不會特別嚴重，特別是這種較大的時鐘跳躍每天只有一次時。

source: Publishing
zh_tw: 發布

source: If I publish something in Freenet, how will people find it? Don't they have to know the key I used?
zh_tw: 如果我在 Freenet 發布了某些東西，人們如何找到它？難道它們必須知道我使用的鍵值？

source: How do I publish a Content Hash Key (CHK)?
zh_tw: 我該如何發布一個 內容 Hash 鍵值（CHK）？

source: A Content Hash Key is based on the actual content contained within it - and as such, the key will only be known after it has been inserted into Freenet. To insert a CHK, simply insert it as "CHK@", Freenet will tell you what the actual CHK is once the insertion completes.
zh_tw: 內文的哈希密鑰是基於包含在內文的資訊,因此,這個密鑰只有在植入Freenet 之後才會被知道.要插入CHK,只要加入"ＣＨＫ@",一旦完成Ｆreenet 就會告訴你實際的CHK是什麼

source: Can Freenet documents be updated / deleted?
zh_tw: Freenet 文檔可以被更新 / 刪除？

source: Contributing
zh_tw: 貢獻

source: I have this great idea....
zh_tw: 我有個好主意...

source: Good! First step: read the [mailing list archives](help.html#mailing-lists). Odds are good that someone else had the same idea and discussed it with the group. Either a flaw was found in the idea, or perhaps it was decided to postpone implementing the idea until later. Some examples of ideas already discussed are storing information by content hash, key redirection, signed keys/data, use of UDP, server discovery, URLs, document versioning, and others. If you don't see the idea discussed in the archives, by all means bring it up in the appropriate [mailing list](help.html#mailing-lists).
zh_tw: 好,第一步:閱讀郵件群組 [mailing list archives](help.html#mailing-lists). 在這裏往往有機會遇上某些有著共同想法的朋友,可以此群組中作討論 不管想法是否有缺陷或是決定延後付諸施行 有些案例中,一些想法被討論並存了下來,包括資料作為內容哈希格式,密鑰重新指向,簽署密鑰資料,使用UDP,伺服器發現,URLs, 文件版本等等 如果你用盡各種方式卻無法看到這個檔案庫中的討論資料 請把問題回報到合適的郵件群組上

source: Can I contribute to the Freenet Project?
zh_tw: 我能幫助 Freenet 項目嗎？

source: If you have any questions about contributing, please contact us, via [the developers mailing list][url_devlist], [the chat channel][url_chat], [the support mailing list][url_supportlist] or anonymously via the freenet board on FMS. Last but not least you can [donate][url_donate] to support our paid developer(s) and cover server costs.
zh_tw: 如果你有任何問題,請和我們聯繫,可透過[開發者的郵件群組][url_devlist],, [聊天頻道][url_chat], [支持者的郵件群組][url_supportlist] 或是以匿名方式在FMS上的Freenet 討論版. 最後你可以 [捐款][url_donate] 來支持我們聘僱的開發者與支應各種伺服器的成本開支.

source: How can I access the code and website?
zh_tw: 我怎樣才能訪問代碼和網站？

source: See our [GitHub repository](https://github.com/freenet/).
zh_tw: 參見我們的 [GitHub 版本庫](https://github.com/freenet/)。

source: What tools do I need to help develop?
zh_tw: 我需要什么工具來幫助開發嗎？

source: Building Freenet requires JDK 1.6 or later. You can download the source tarballs on the download page for a specific build, or use git to get an up to date copy of the source, see [here](contribute.html#developers) for details. Further instructions for building and deploying the server are included with the code itself. Generally speaking, joining our IRC channel is a good idea: [#freenet on chat.freenode.net](irc://chat.freenode.net/freenet)
zh_tw: 安裝Ｆreenet 需要JDK1.6以上的版本.你可在下載頁面找到特定版本, 或是依據版本日期來源下戴 參見 [here](contribute.html#developers) 詳情 有關安裝與佈局伺服器的進一步指示 已包含在程式當中 一般說來,加入IRC聊天頻道是個好方法: [#freenet on chat.freenode.net](irc://chat.freenode.net/freenet)

source: Is there a Help Site that goes deeper into the questions newbies may have about Freenet, and where people can contribute too?
zh_tw: 有沒有幫助台來解答新手提出的有關 Freenet 的問題，以及人們可以在那里做出貢獻？

source: Where can I report bugs?
zh_tw: 我可以在哪報告 Bug？

source: You can use our [bug tracking system](https://bugs.freenetproject.org/) or send a mail to our [support mailing list](help.html#mailing-lists).
zh_tw: 您可以使用我們的 [Bug 跟蹤系統](https://bugs.freenetproject.org/) 或者發郵件到 [用戶支持郵件列表](help.html#mailing-lists)。

source: I'm a theoretical computer scientist/mathematician, how can I help?
zh_tw: 我是個理論計算機科學家/數學家，我能幫什么嗎？

source: See [here](https://wiki.freenetproject.org/Research_challenges).
zh_tw: 參見[這里](https://wiki.freenetproject.org/Research_challenges)。

source: Security
zh_tw: 安全

source: Can I use my regular browser to browse Freenet?
zh_tw: 我可以使用我的日常瀏覽器瀏覽 Freenet 嗎？

source: Won't attack X break Freenet's anonymity?
zh_tw: 攻擊者不會破解 Freenet 的匿名性？

source: **Major known attacks**: In the interests of giving would-be users as much information as possible, and on the assumption that any serious attacker would do their homework, here are the major classes of attack on Freenet we are presently aware of:
zh_tw: **已知的主要攻擊** 為了提供潛在的使用者盡可能有用的資訊 且假設任何認真的攻擊方會先作點功謂 這裏是Freenet我們明顯知道的主要攻擊類別：

source: More information on the current practical state of Freenet security is available [here](https://wiki.freenetproject.org/Security_summary).
zh_tw: 更多Freenet 安全與實際應用的相關資訊，請參考 [此處](https://wiki.freenetproject.org/Security_summary).

source: Is Freenet vulnerable to flooding attacks?
zh_tw: Freenet 易遭受洪泛攻擊？

source: Why hash keys and encrypt data when a node operator could identify them (the data) anyway if he tried?
zh_tw: 為何某個節點操作者可以識別哈希值與加密資料?

source: What about hostile "cancer" nodes within the network?
zh_tw: 什么是網絡內的惡意節點？

source: What about attack Y?
zh_tw: 攻擊 Y是什麼?

source: What private data does Freenet store? How do I get rid of it? How can I secure my computer so I am safe when running Freenet?
zh_tw: Freenet 會存儲什麼隱私數據？我該如何擺脫它？如何保護我的電腦，保證我在運行 Freenet 的時候足夠安全？

source: Windows SmartScreen filter warns the Freenet installer might put my PC at risk. What's going on?
zh_tw: Windows SmartScreen 過濾器警告 Freenet 安裝程序可能使我的計算機陷入危險。這是怎么回事？

source: [SmartScreen][url_smartscreen] is sometimes incorrect in classifying a file as dangerous. We believe our installer is not infected with malicious software, and if you are a developer you can check the installer source code [here][url_installer].
zh_tw: [SmartScreen][url_smartscreen] 有點無法分類一些檔案會造成危害 我們相信我們的安裝不會被惡意軟體所污染 如果你是一名開發人員,可以確認安裝的原始碼 [here][url_installer].

source: Has anyone ever faced legal trouble for their anonymous activities conducted on Freenet?
zh_tw: 在使用Freenet時，是否有人曾因匿名的行動，面臨了法律上的麻煩？

source: ### Additional information sources * [Wiki FAQ page][url_wiki] * [Security summary][url_security] * [High quality copy of the rabbit icon][url_rabbit_icon]
zh_tw: ###其它資訊來源 * [Wiki FAQ page][url_wiki] * [安全摘要整理][url_security] * [高畫質的免子圖示檔案][url_rabbit_icon]

source: Mailing lists
zh_tw: 郵件列表

source: These are the mailing lists that can be used for support or general information about Freenet.
zh_tw: 這些郵件群組被用來提供關於 Freenet的相關資訊

source: ### Subscribing To subscribe to one of the lists, click the list name and give your email address in the field below the **Subscribing to < mailinglist >** header. To enter a password is optional, and if you do not enter one, one will be automatically generated for you. Then press the **Subscribe** button. You will receive a confirmation email, and when that is answered, you will receive mails from the list.
zh_tw: ### 訂閱 要訂閱任一電子報，只要點擊電子報名稱並在下方的 **Subscribing to < mailinglist >** 訂閱欄位中寫下你的電子郵件資料。是否要自定密碼則可依個人喜好，無密碼時系統會自動生成一組密碼。然後按確認訂閱 **Subscribe** 鍵 。你會收到一封確認信；當我們收到回覆，你就可以收到我們的電子報。

source: ### Unsubscribing To unsubscribe to one of the lists you are subscribed to, click the list name and give your subscription email address under the heading **< mailinglist > Subscribers** and press the button **Unsubscribe or edit options**. _**Note**: We constantly get requests of people who want to become unsubscribed._ **YOU** _have to do that yourself! Just click on the www link provided at the bottom of every mail, enter your e-mail address in the text field in section "Subscribers" and provide your password under the unsubscribe option. (You can get your password there as well, in case you forgot it.)_
zh_tw: ### 退訂 要退訂任一電子報，只要點擊電子報名稱並在下方的 **< mailinglist >Subscribers** 欄位中寫下你的電子郵件資料，然後按下「退訂或編輯設定」**Unsubscribe or edit options** 鍵。 _**備註**：我們不斷收到取消訂閱的請求。退訂必須由**你自己**來做！只要到網頁上點選提供給各類電子報的網頁連結，在「Subscribers」部份的文字欄輸入你的電子郵件，並在「退訂」選項中提供你的確認密碼即可。（如果你忘記密碼,可以要求系統重寄）。_

source: Suggestions
zh_tw: 建議

source: Get Support
zh_tw: 取得支援

source: Create a support discussion
zh_tw: 建立一則求助的討論文

source: Chat with us
zh_tw: 與我們聊聊

source: Many of the developers and users of Freenet are on the [IRC]( https://en.wikipedia.org/wiki/IRC) channel #freenet on chat.freenode.net.
zh_tw: 許多 Freenet 的開發者和用戶在這個 [IRC]( https://en.wikipedia.org/wiki/IRC) 頻道: chat.freenode.net 上的 #freenet 頻道。

source: Setup
zh_tw: 安裝

source: Help
zh_tw: 幫助

source: Leap over censorship<br> Escape total surveillance
zh_tw: 跳過審查<br> 逃過監控

source: Freenet is a peer-to-peer platform for censorship-resistant communication and publishing. Browse websites, post on forums, and publish files within Freenet with strong privacy protections.
zh_tw: Freenet 是一個抗審查的通訊和內容釋出平臺。 瀏覽網頁、入壇灌水、上傳檔案，您的隱私受到強力保護。

source: read more…
zh_tw: 了解更多…

source: Help keep Internet freedom alive and expand human liberty! Support another year of paid development. [Learn more about our fundraiser.][url_fundraiser]
zh_tw: 幫助捍衛互聯網自由和人類自由！支持下一年的有償開發。[了解我們的投資人。][url_fundraiser]

source: Donate!
zh_tw: 捐款！

source: The Freenet Project Inc is a non-profit 501(c)(3) organization.
zh_tw: The Freenet Project Inc 是一個 501(c)(3) 非盈利組織。

source: Donations are tax-deductible.
zh_tw: 捐款可以免稅。

source: Secret Identity
ru: Сокрытие личности
zh_tw: 秘密身份

source: Create a secret identity so nobody knows who you are.
zh_tw: 創建一個秘密身份，沒人知道您是誰。

source: Browse Websites
ru: Просмотр веб-сайтов
zh_tw: 瀏覽網站

source: Freenet is home to sites ranging from programming to sustainable living.
zh_tw: 從編程網站到綠色生活網站，Freenet 都是您的家。

source: Forums
ru: Форумы
zh_tw: 論壇

source: Ask questions and exchange ideas.
zh_tw: 提出問題和交換想法。

source: Publish
zh_tw: 發布

source: Publish anonymously without need for a server.
zh_tw: 發布匿名信息，無需服務器。

source: Share Files
zh_tw: 分享文件

source: Easy upload & download.
zh_tw: 輕松上傳和下載。

source: Platform
ru: Платформа
zh_tw: 平台

source: Write your own applications on the Freenet platform.
zh_tw: 在 Freenet 平台上編寫您自己的應用程序。

source: Resistant
zh_tw: 堅實

source: Freenet has been designed to be resistant to attacks and censorship.
zh_tw: Freenet 專為抵御攻擊和網絡審查而設計。

source: Distributed
zh_tw: 去中心化

source: No central points of failure, efficient caching of popular content.
zh_tw: 無中心故障點，流行內容高效緩存。

source: Proven
zh_tw: 成熟

source: Based on solid research and in practical use for 15 years.
zh_tw: 基於扎實研究，并已實際使用15年。

source: Share, Chat, Browse. Anonymously.
zh_tw: 分享，聊天，瀏覽。不露蹤跡

source: Latest News
zh_tw: 最新消息

source: Overview
zh_tw: 概述

source: Donate today.
zh_tw: 今天就捐款吧！

source: 2016-06-25 - Freenet build 1475 released
zh_tw: 2016-06-25 - Freenet 0.7.5 build 1475 釋出

source: 2016-05-26 - Police department's tracking efforts based on false statistics
zh_tw: 2016-05-26 - 警察部門的追踪精力是立基在錯誤的統計上。

source: 2016-05-22 - Freenet build 1473 released
zh_tw: 2016-05-22 - Freenet build 1473版本發佈

source: 2016-05-03 - DuckDuckGo donated $25,000
zh_tw: 2016-05-03 - DuckDuckGo捐贈 $25,000美元

source: 2016-04-10 - Freenet testing build 1473-pre1 released
zh_tw: 2016-04-10 - Freenet 測試 1473-pre1版的發佈

source: Freenet unstable testing prerelease build 1473-pre1 is now available. It's the first build to require Java 7. Highlights: * Add The Filtered Index to the default bookmark list * Improve MP3 filter stability * Fix binary blob download over FCP * Fix handling of filenames with non-ASCII spaces For more details and information on how to test this release see the [development mailing list thread][devl_thread].
zh_tw: Freenet 非穩定的測試版本 1473-pre1 現已釋出。 這是必需使用 Java 7 的首個版本。 亮點： * 新增 The Filtered Index 到預設書籤列表 * 改進 MP3 過濾器穩定性 * 修復通過 FCP 下載二進位制資料 * 修復非 ASCII 空格的檔名處理 更多測試此版本的資訊和細節參見[郵件列表-開發的討論主題][devl_thread]。

source: 2016-03-19 - Freenet 0.7.5 build 1472 released
zh_tw: 2016-03-19 - Freenet 0.7.5 1472 版發佈

source: 2016-01-03 - Testing release build 1471-pre3
zh_tw: 2016-01-03 - 測試版本 1471-pre3 已發布

source: Freenet unstable testing prerelease 1471-pre3 is now available. This is feature-complete and hopefully the last testing release before the stable release of build 1471. Build 1471 will be the last to support Java 6. Highlights: - Fix uploads stalling when using MAXIMUM physical security. - Fix lots of "setNativePriority(X) has failed!", which was caused by a serious thread priority problem. This might fix nodes unexpectedly losing peers. - Order alerts within a category by time: if you have lots of messages from darknet peers they will remain nicely sorted. For more information and how to help test see the [developer mailing list][devl_1471].
zh_tw: Freenet 不穩定測試預發布版本 1471-pre3 現在可以下載了。 此版本計划的功能已經完成，希望是 1471 穩定版本前的最后一個測試版本。版本 1471 會是最后一個支持 Java 6 的版本。 亮點： - 修正了在使用最高物理安全級別時上傳卡住的問題。 - 修正了大量「setNativePriority(X) has failed!”錯誤。此錯誤是由一個嚴重的線程優先級問題導致的。這也可能修正了異常丟失節點的問題。 - 警告信息現在按分類和時間排序：如果您有很多來自暗網節點的消息，它們會很好的排序。 要了解更多信息并協助測試，請訪問[開發者郵件列表][devl_1471]。

source: 2015-12-20 - "Weekend of Code" hackathon results
zh_tw: 2015-12-20 - “周末編碼”編程馬拉松結果

source: During the hackathon we got some changes done: - [Fix uploads stalling when using MAXIMUM physical security.][1] - [Fix lots of "setNativePriority(X) has failed!"][2] - [Fix Bokmål localization loading.][3] - [Fix JVM version string parsing.][4] - [Fix and add test for broken localization substitution token pairs.][5] - [Remove Gantros Index][6] because it stopped updating. - [Remove Linkageddon][6] because it stopped updating. - [Remove deprecated negtype crypto.][7] - [Order alerts by date.][8] - [Progress toward Freemail "to" field autocomplete.][9] - Progress toward changing the language setting in Winterface. - Progress toward building and verifying dependencies for [Fred][10] and [Winterface][11] using [Gradle][12] and [gradle-witness][13]. If we're able to get final changes ready build 1471-pre3 will be released the weekend of January 2nd.
zh_tw: 在馬拉松期間我們完成了如下變更： - [使用最大物理安全時上傳卡住的問題。][1] - [修正大量「setNativePriority(X) has failed!”錯誤。][2] - [修正書面挪威語加載問題。][3] - [修正 JVM 版本字符串解析問題。][4] - [修正了本地語言字符串 Token 替換問題并添加了測試。][5] - [已除了 Gantros 書簽][6]，因為其已停止更新。 - [已除了 Linkageddon 書簽][6]，因為其已停止更新。 - [已除了已過時的 negtype 加密方式。][7] - [根據日期對警告排序。][8] - [Freemail “發件人”輸入框自動完成功能。][9] - Winterface 語言設置功能。 - 使用 [Gradle][12] 和 [gradle-witness][13] 編譯和驗證 [Fred][10] 和 [Winterface][11]。 如果我們無法及時完成變更，1月2日周末，我們會發布 1471-pre3。

source: 2015-12-12 - New OS X installer and tray app
zh_tw: 2015-12-12 - 新的 OS X 安裝程序和系統托槃 App

source: The [Freenet installer][downloads_url] for OS X is now a native application. It should fix several major installation problems OS X users have encountered in the past. It also includes an updated [tray application][tray_url] with bugfixes and new features. All Freenet users on OS X are encouraged to [download][tray_release_url] the new tray application. ![][tray_screenshot_url]
zh_tw: 蘋果 OS X 的 [Freenet 安裝程序][downloads_url]現在是一個原生應用了。它解決了過去 OS X 用戶遇到的數個主要安裝問題。 它也包含了一個更新的[系統托槃應用][tray_url]。新的托槃應用修正了 Bug，新增了几個功能。 所有 OS X 的 Freenet 用戶建議[下載][tray_release_url]新的托槃應用。 ![][tray_screenshot_url]

source: 2015-12-12 - Appeal for donations
zh_tw: 2015-12-12 - 捐款呼吁

source: 2015-11-20 - "Weekend of Code" hackathon announcement
zh_tw: 2015-11-20 - “周末編碼”編程馬拉松公告

source: ## Who? We welcome developers of all skill levels, designers, translators, and users. ## What? The Freenet Project is holding a "Weekend of Code" hackathon to improve user experience. ## When? The weekend of December 19th and 20th. ## Where? [chat.freenode.net #freenet][irc_url] [FLIP][flip_url] #freenet Local meetups are arranged separately. ## Details See the [wiki Hackathon page][hackathon_url] for details. Happy hacking!
zh_tw: ## 誰？ 我們歡迎不同技術層級的開發者、設計師、翻譯者與使用者。 ## 什麼？ Freenet 專案舉辦「週末編程」駭客松以改善使用者體驗。 ## 時間？ 12月19、20日的週末. ## 地點 [chat.freenode.net #freenet][irc_url] [FLIP][flip_url] #freenet 各地的會面則另有不同安排。 ## 詳情 參閱[wiki 駭客松頁面][hackathon_url]了解詳情。 編程愉快！

source: 2015-10-25 - Prerelease and Windows installer
zh_tw: 2015-10-25 - 預發布版本，以及 Windows 安裝程序
