Repository: Bombe/hyphanet-website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: ru, zh_tw

source: The Windows installer has updated translations for French, Indonesian, and Simplified Chinese, and is newly translated into Bulgarian, Croatian, and Japanese. In addition, Freenet unstable testing prerelease 1471-pre2 is now available. For details on what it contains and how to test it see the [release announcement][announcement].
zh_tw: 我們為 Windows 安裝程序更新了法語、印尼語和簡體中文翻譯，并添加了保加利亞語、克羅地亞語和日語翻譯。 另外，Freenet 測試版 1471-pre2 已經提供下載。 要了解更多版本更新信息和測試指南，請閱讀 [發布公告][announcement]。

source: 2015-10-21 - Website redesign is live
zh_tw: 2015-10-21 - 網站全新改版！

source: The redesigned website is now live! Existing URLs [redirect](http://www.w3.org/Provider/Style/URI.html) to their new equivalents. Thanks to everyone who contributed feedback, development, and translations. If we missed something, please tell us in our [support chat](help.html#irc)!
zh_tw: 全新設計的網站已經正式上線啦！ 舊網站中的網址都已[自動重定向](http://www.w3.org/Provider/Style/URI.html) 到新網站中對應的網址。感謝所有提供反饋，參與開發和翻譯的朋友們。 如果您有任何意見和建議，請在 [IRC 聊天室](help.html#irc) 與我們取得聯系。

source: 2015-10-11 - Upcoming website redesign
zh_tw: 2015-10-11 - 重新設計的網站即將上線

source: 2015-09-17 - elliptic curves: using safe Bouncy Castle since November 2014
zh_tw: 2015-09-17 - 橢圓曲線：使用2014年10月后發布的 Bouncy Castle 安全版本

source: 2015-08-16 - Freenet 0.7.5 build 1470 released
zh_tw: 2015-08-16 - Freenet 0.7.5 build 1470 發布

source: <p> This release fixes Freemail problems that prevented sending mail, and removes a compromised opennet seed node. Freemail also gains a new message link on the inbox page, links to senders' WoT profiles, and new translations: </p> <ul> <li>Czech</li> <li>Greek</li> <li>Spanish</li> <li>Finnish</li> <li>Hungarian</li> <li>Dutch</li> <li>Polish</li> <li>Portuguese (Portugal)</li> <li>Serbian</li> <li>Turkish</li> </ul> <p> To clarify, the CHK metadata bug fixes in 1468 are added as a new compatibility mode that is not yet the default. Compatibility with 1416 keys is available. </p> <p> The Fred Spanish translation has comprehensive updates as well. </p>
zh_tw: <p> 這個版本修正了Freemail無法寄信問題也移除了opennet 種子節點. Freemail 也可以在收件筴頁上看到新訊息連結 以及送件者的 WoT 身份,和以下的語言版本 </p> <ul> <li>捷克文</li> <li>希臘文</li> <li>西語</li> <li>芬蘭文</li> <li>匈牙利文</li> <li>荷文</li> <li>波蘭文</li> <li>萄語</li> <li>塞爾維亞文</li> <li>土耳其文</li> </ul> <p> 聲明, CHK １468 的詮釋資料問題已被修正,被新增相容的模組 但其尚未成為預設. 1416 的相容密鑰可用. </p> <p> 西語翻譯也全面即時更新. </p>

source: 2015-08-07 - Windows translation update
zh_tw: 2015-08-07 - Windows 翻譯更新

source: <p> The Windows installer and tray app have updated translations. The installer is newly translated into Portuguese (Portugal) and Serbian. The tray app is newly translated into Spanish, Persian, Portuguese (Portugal), and Serbian. This also fixes a tray app problem where translations for Brazilian Portuguese and Simplified Chinese were not used. </p>
zh_tw: <p> Windows安裝以及工作列的程式顯示已有了更新翻譯版本 安裝器已有萄語,塞爾維亞文版本 工作列顯示則有西語,波斯文,萄語,塞爾維亞文 我們也修正了巴西萄語和簡體中文工作列顯示的程式問題

source: 2015-07-19 - Freenet 0.7.5 build 1469 released
zh_tw: 2015-07-19 - Freenet 0.7.5 build 1469 發布

source: 2015-07-13 - Build 1468 known issues
zh_tw: 2015-07-13 - Build 1468 已知問題

source: 2015-07-11 - Freenet 0.7.5 build 1468 released
zh_tw: 2015-07-11 - Freenet 0.7.5 build 1468 發布

source: 2015-06-27 - New Windows installer and tray app
zh_tw: 2015-06-27 - 新的 Windows 安裝程序和托槃程序

source: 2015-06-24 - Upcoming installer and testing releases
zh_tw: 2015-06-24 - 安裝程序和測試發布即將到來

source: 2015-05-22 - UN Report: Encryption and Anonymity Deserve Strong Protection
zh_tw: 2015-05-22 - 聯合國報告：加密和匿名應得到保護

source: 2015-04-14 - SUMA Award Acceptance Speech (video)
zh_tw: 2015-04-14 - SUMA 獲獎感言（視頻）

source: 2015-03-29 - New Linux/Unix/OS X installer
zh_tw: 2015-03-29 - 新的 Linux/Unix/OS X 安裝程序

source: The installer for Linux, Unix, and Mac OS X is updated to better detect Java.
zh_tw: 面向 Linux、Unix 和 Mac OS X 的安裝程序已經更新，可以更好的檢測 Java。

source: 2015-03-15 - Progress toward build 1468
zh_tw: 2015-03-15 - 走向 build 1468

source: 2015-03-14 - Freenet translation joins Localization Lab
zh_tw: 2015-03-14 - Freenet 翻譯加入 Localization Lab

source: The Freenet Project has joined the [Localization Lab](http://www.localizationlab.org) organization on Transifex. This allows a larger team of translators, translating into more languages, and access to paid support. If this transition has caused any problems please let us know!
zh_tw: Freenet 項目已加入 Transifex 上的 [Localization Lab](http://www.localizationlab.org) 組織。這可以帶來更大的翻譯團隊，翻譯成更多的語言，以及獲得付費支援。 如果這一轉換引發了任何問題，請告知我們！

source: 2015-02-15 - New Windows tray app for testing
zh_tw: 2015-02-15 - 新的 Windows 托槃應用面向測試

source: 2015-02-11 - Freenet received the SUMA Award 2014/15
zh_tw: 2015-02-11 - Freenet 獲得 SUMA Award 2014/15

source: 1st January 2015 - apt-get over Freenet
zh_tw: 2015年1月1日 - 基於 Freenet 的 apt-get

source: 2014-11-23 - Freenet 0.7.5 build 1467 released
zh_tw: 2014-11-23 - Freenet 0.7.5 build 1467 發布

source: 2014-11-09 - Freenet 0.7.5 build 1466 released
zh_tw: 2014-11-09 - Freenet 0.7.5 build 1466 發布

source: 2013-08-05 - Statement on the recent Freedom Hosting (Tor) bust
zh_tw: 2013-08-05 - 有關最近自由托管 (Tor) 受損的聲明

source: 2013-06-26 - Freenet gets a second paid developer to fix the Web of Trust!
zh_tw: 2013-06-26 - Freenet 得到了第二名付費開發者來修復 Web of Trust！

source: 2012-09-11 - Response to the University of Hawaii's "Experimental Study of Accountability in Existing Anonymous Networks"
zh_tw: 2012-09-11 - 響應夏威夷大學的 "Experimental Study of Accountability in Existing Anonymous Networks"

source: 2011-04-13 - Freenet top anti-censorship tool in survey of Chinese users!
zh_tw: 2011-04-13 - Freenet 是中國用戶的頂級反審查工具！

source: A [report](http://www.freedomhouse.org/sites/default/files/inline_images/Censorship.pdf) by [Freedom House](http://freedomhouse.org/) surveyed users in Azerbaijan, Burma, [China](http://www.freedomhouse.org/sites/default/files/LOtF_China.pdf) and Iran for their perceptions of and preferred tools for bypassing local government censorship. In China, Freenet was the only anti-censorship tool to achieve 5 stars, and the third most widely used overall.
zh_tw: [Freedom House](https://freedomhouse.org/) 制作了一份[報告](https://www.freedomhouse.org/sites/default/files/inline_images/Censorship.pdf)，其中對阿塞拜疆、緬甸、[中國](https://www.freedomhouse.org/sites/default/files/LOtF_China.pdf)和伊朗用戶對繞過當地政府審查的首選工具進行了調查。在中國，Freenet 是唯一的達到5星的反審查工具，并且是第三個被廣泛使用的工具。

source: News
zh_tw: 新聞

source: Title of the Section
zh_tw: 章節標題

source: Markdown text
zh_tw: Markdown 文本

source: Title
zh_tw: 標題

source: Page Title
zh_tw: 頁面標題

source: Freenet is a peer-to-peer platform for censorship-resistant communication and publishing.
ru: Freenet - это одноранговая платформа, которая обеспечивает устойчивую к цензуре коммуникацию и публикацию.

source: Learn
ru: Изучить

source: Protect your privacy
ru: Защитить свою конфиденциальность

source: Support the Freenet Project
ru: Поддержать Freenet Project

source: Protect internet privacy and freedom
ru: Защитить конфиденциальность и свободу в интернете

source: Freenet Features
ru: Особенности Freenet

source: Browse websites, post on forums, and publish files within Freenet with strong privacy protections.
ru: Просматривайте веб-сайты, публикуйте сообщения на форумах и создавайте файлы в Freenet с надежной защитой конфиденциальности.

source: Create yours so nobody knows who you are
ru: Создайте свой аккаунт так, чтобы никто не знал, кто вы

source: Freenet is home to sites ranging from programming to sustainable living
ru: Freenet является домом для сайтов, начиная от их программирования до поддержки

source: Ask questions and exchange ideas
ru: Задавайте вопросы и обменивайтесь идеями

source: Build your own decentralized application on the Freenet platform
ru: Создавайте свое собственное децентрализованное приложение на платформе Freenet

source: What's New
ru: Что нового?

source: News about Freenet, internet freedom and privacy rights.
ru: Новости о Freenet, свободе в Интернете и правах на конфиденциальность

source: Why we do this
ru: Почему мы это делаем?

source: I worry about my child and the Internet all the time, even though she's too young to have logged on yet. Here's what I worry about. I worry that 10 or 15 years from now, she will come to me and say
ru: Я все время переживаю за своего ребенка и за интернет, хотя она еще слишком мала, чтобы войти в систему. Вот о чем я беспокоюсь. Я переживаю, что через 10 или 15 лет она придет ко мне и скажет

source: Daddy, where were you when they took freedom of the press away from the Internet
ru: папочка, где ты был, когда они забрали свободу из прессы и Интернета?

source: I worry about my child and the Internet all the time, even though she's too young to have logged on yet. Here's what I worry about. I worry that 10 or 15 years from now, she will come to me and say 'Daddy, where were you when they took freedom of the press away from the Internet?
ru: Я постоянно переживаю за своего ребенка и за Интернет, хотя она еще слишком мала, чтобы войти в систему. Вот, о чем я беспокоюсь. Я переживаю, что через 10 или 15 летона придет ко мне и скажет: 'Папа, где ты был, когда они забрали свободу прессы из Интернета?'

source: --Mike Godwin, <a href="https://www.eff.org/">Electronic Frontier Foundation</a>
ru: --Майк Годвин, <a href="https://www.eff.org/">Фонд электронных рубежей</a>

source: <em>Written by Ian Clarke</em>
ru: <em>Ян Кларк пишет</em>

source: <a href="#a-disclaimer">A Disclaimer</a>
ru: <a href="#a-disclaimer">Дисклеймер</a>

source: <a href="#suggested-prior-reading">Suggested prior reading</a>
ru: <a href="#suggested-prior-reading">Рекомендованное предварительное чтение</a>

source: <a href="#the-importance-of-the-free-flow-of-information">The importance of the Free flow of information</a>
ru: <a href="#the-importance-of-the-free-flow-of-information">Важность свободного обмена информацией</a>

source: <a href="#censorship-and-freedom">Censorship and freedom</a>
ru: <a href="#censorship-and-freedom">Цензура и свобода</a>

source: <a href="#the-solution">The solution</a>
ru: <a href="#the-solution">Решение</a>

source: <a href="#isnt-censorship-sometimes-necessary">Isn't censorship sometimes necessary?</a>
ru: <a href="#isnt-censorship-sometimes-necessary">Иногда цензура нужна, разве нет?</a>

source: <a href="#but-why-is-anonymity-necessary">But why is anonymity necessary?</a>
ru: <a href="#but-why-is-anonymity-necessary">Но зачем нужна анонимность?</a>

source: <a href="#and-what-of-copyright">And what of copyright?</a>
ru: <a href="#and-what-of-copyright">Что такое Копирайт?</a>

source: <a href="#but-how-will-artists-be-rewarded-for-their-work-without-copyright">But how will artists be rewarded for their work without copyright?</a>
ru: <a href="#but-how-will-artists-be-rewarded-for-their-work-without-copyright">Но как люди творчества будут вознаграждены за свою работу без Копирайта?</a>

source: <a href="#alternatives-to-copyright">Alternatives to Copyright</a>
ru: <a href="#alternatives-to-copyright">Альтернативы копирайту</a>

source: The Philosophy Behind Freenet
ru: Философия Freenet

source: A Disclaimer
ru: Дисклеймер

source: There are many reasons why people get involved in the Freenet Project. Some share the views outlined in this document; some share variations of these views, which are also served by what we are trying to achieve; and some just enjoy the technical challenge. These are the ideas which motivated me to architect the system in the first place, but not necessarily the views that everyone involved in the Freenet Project holds.
ru: Есть много причин, почему люди участвуют в разработке Freenet. Некоторые разделяют взгляды, изложенные в этом документе; некоторые разделяют вариации этих взглядов, и также заинтересованы в успехе проекта; а некоторым просто нравится решать сложные и интересные технические задачи проекта. Ниже изложены мысли, которые в первую очередь побудили меня создать такую систему, но они не обязательно отражают взгляды всех участников проекта Freenet.

source: Suggested prior reading
ru: Рекомендованное предварительное чтение

source: For this document to make sense, you should probably know what Freenet is. You can get a good overview from <a href="about.html#introduction">What is Freenet?</a>.
ru: Для того, чтобы этот документ имел смысл, вам, вероятно, стоит понимать, что такое Freenet. <a href="about.html#introduction">Здесь</a> вы можете получить общее представление о проекте

source: The importance of the Free flow of information
ru: Важность свободного обмена информацией

source: Freedom of speech, in most western cultures, is generally considered to be one of the most important rights any individual might have. Why is the freedom to share ideas and opinions so important? There are several ways to answer this question.
ru: Свобода слова в большинстве западных культур, как правило, считается одним из самых важных прав, которые может иметь каждый человек. Почему свобода обмена идеями и мнениями так важна? Есть несколько способов ответить на этот вопрос.

source: Communication is what makes us human
ru: Общение - это то, что делает нас людьми

source: One of the most obvious differences between mankind and the rest of the animal kingdom is our ability to communicate sophisticated and abstract concepts. While we constantly discover that animal's communication ability is more sophisticated than previously assumed, it is unlikely that any other animal approaches our own level of ability in this area.
ru: Наша способность передавать сложные и абстрактные понятия - одна из наиболее очевидных различий между человечеством и животным миром. Несмотря на то, что мы постоянно обнаруживаем, что коммуникационные способности животных являются более сложными, чем предполагалось ранее, маловероятно, что любое другое животное приблизится к нашему собственному уровню способностей в этой области.

source: Knowledge is good
ru: Знания - это хорошо

source: Most people, given the option of knowing something and not knowing something, will choose to have more information rather than less. Wars have been won and lost over who was better-informed. This is because being better-informed allows us to make better decisions, and generally improve our ability to survive and be successful.
ru: Большинство людей, у которых есть выбор: знать что-то или нет, предпочитает получать больше информации. Войны были выиграны и проиграны из-за того, кто был более проинформирован. Информация позволяет нам принимать более правильные решения, и в целом улучшать нашу способность выживать и быть успешными.

source: Democracy assumes a well informed population
ru: Демократия предполагает высокий уровень проинформированности населения

source: Many people today live under democratic governments, and those who don't, probably want to. Democracy is an answer to the question of how to create leaders, while preventing them from abusing that power. It achieves this by giving the population the power to regulate their government through voting, yet the ability to vote does not necessarily mean that you live in a democratic country. For a population to regulate their government effectively it must know what their government is doing, they must be well informed. It is a feedback loop, but this loop can be broken if the government has the power to control the information the population has access to.
ru: В современном мире многие живут в странах с демократическим правительством, а те, кто нет, вероятно, хотят этого. Демократия - это ответ на вопрос о том, как создавать лидеров, не давая им возможности злоупотреблять властью. Это достигается путем предоставления населению полномочий регулировать свое правительство с помощью голосования, однако право голосовать не обязательно означает, что вы живете в демократической стране. Чтобы население эффективно регулировало свое правительство, необходима информация о его работе. Это система обратной связи, которая может быть нарушена, если правительство получит право контролировать доступную для населения информацию.

source: Censorship and freedom
ru: Цензура и свобода

source: Everyone values their freedom, in fact, many consider it so important that they will die for it. People like to think that they are free to form and hold whatever opinions they like, particularly in western countries. Consider now that someone had the ability to control the information you have access to. This would give them the ability to manipulate your opinions by hiding some facts from you, by presenting you with lies and censoring anything that contradicted those lies. This is not some Orwellian fiction, it is standard practice for most western governments to lie to their populations, so much so, that people now take it for granted, despite the fact that this undermines the very democratic principles which justify the government's existence in the first place.
ru: Каждый человек ценит свою свободу. И, на самом деле, многие считают ее настолько важной, что готовы за нее умереть. Людям нравится думать, что они могут свободно формировать и придерживаться любых мнений, которые им нравятся, особенно это проявляется в западных странах. Теперь представьте, что кто-то была бы возможность контролировать доступную для вас информацию. Это дало бы им возможность манипулировать вашим мнением, скрывая от вас какие-то факты, преподнося вам ложь и подвергая цензуре все, что ей противоречит. Это не какая-то оруэлловская выдумка, врать своему населению - это обычная практика большинства западных правительств. Люди настолько к обману со стороны правительства, что считают это как само собой разумеющимся. Несмотря на то, что это подрывает те самые демократические принципы, которые собственно оправдывают существование правительства.

source: The solution
ru: Решение

source: The only way to ensure that a democracy will remain effective is to ensure that the government cannot control its population's ability to share information, to communicate. So long as everything we see and hear is filtered, we are not truly free. Freenet's aim is to allow two or more people who wish to share information, to do so.
ru: Единственный способ обеспечить эффективность демократии - это сделать так, чтобы правительство не могло контролировать процесс распространения информации, общения среди людей. Пока все, что мы видим и слышим, фильтруется, мы не свободны по-настоящему. Цель Freenet - позволить людям, которые хотят поделиться информацией, сделать это.

source: Isn't censorship sometimes necessary?
ru: Иногда цензура нужна, разве нет?

source: Of course no issue is black and white, and there are many who feel that censorship is a good thing in some circumstances. For example, in some European countries propagating information deemed to be racist is illegal. Governments seek to prevent people from advocating ideas which are deemed damaging to society. There are two answers to this however. The first is that you can't allow those in power to impose "good" censorship, without also enabling them to impose "bad" censorship. To impose any form of censorship a government must have the ability to monitor and thus restrict communication. There are already criticisms that the anti-racism censorship in many European countries is hampering legitimate historical analysis of events such as the second world war.
ru: Конечно, проблема не в том, хорошо это или плохо, и многие думают, что цензура - это нужная вещь при определенных обстоятельствах. Например, в некоторых европейских странах распространение информации, которая считается расистской, является незаконным. Правительства стремятся препятствовать продвижению идей, которые считаются вредными для общества. Однако, есть два возражения на этот счет. Во-первых, вы не можете позволить людям у власти ввести "хорошую" цензуру, не позволяя им также вводить "плохую" цензуру. Для того, чтобы ввести любую форму цензуры, правительство должно иметь возможность контролировать и, следовательно, ограничивать общение. Уже есть критика, что цензура антирасизма во многих европейских странах препятствует законному историческому анализу таких событий, как вторая мировая война.

source: The second argument is that this "good" censorship is counter-productive even when it does not leak into other areas. For example, it is generally more effective when trying to persuade someone of something to present them with the arguments against it, and then answer those arguments. Unfortunately, preventing people from being aware of the often sophisticated arguments used by racists, makes them vulnerable to those arguments when they do eventually encounter them.
ru: Вторым доводом является то, что эта "хорошая" цензура не эффективна, даже если она не проникает в другие области. Например, как правило, можно намного лучше убедить кого-то в чем-то, если показать аргументы против и после возразить им. К сожалению, предотвращение осведомленности людей о зачастую изощренных аргументах, используемых расистами, делает их уязвимыми к этим аргументам, когда они сталкиваются с ними.

source: Of course the first argument is the stronger one, and would still hold-true even if you didn't accept the second. Basically, you either have censorship, or you don't. There is no middle-ground.
ru: Конечно, первый аргумент сильнее и остается правдивым, даже если вы не согласны со вторым. По сути, у вас либо есть цензура, либо нет. Среднего не дано.

source: But why is anonymity necessary?
ru: Но зачем нужна анонимность?

source: You cannot have freedom of speech without the option to remain anonymous. Most censorship is retrospective, it is generally much easier to curtail free speech by punishing those who exercise it afterward, rather than preventing them from doing it in the first place. The only way to prevent this is to remain anonymous. It is a common misconception that you cannot trust anonymous information. This is not necessarily true, using digital signatures people can create a secure anonymous pseudonym which, in time, people can learn to trust. Freenet incorporates a mechanism called "subspaces" to facilitate this.
ru: Свобода слова не возможности без возможности сохранять анонимность. Большая часть цензуры является ретроспективной. Как правило, намного легче ограничить свободу слова, если наказывать тех, кто ее уже применил, нежели предотвратить ее попытки. Единственный способ избежать это - сохранять анонимность. Идея,что вы не можете доверять анонимной информации является распространенным заблуждением. Это не обязательно верно, используя цифровые подписи, люди могут создать безопасный анонимный псевдоним, которому со временем ругие станут доверять. Freenet включает в себя механизм, "subspaces", который делает это возможным.

source: And what of copyright?
ru: Что такое Копирайт?

source: Of course much of Freenet's publicity has centered around the issue of copyright, and thus I will speak to it briefly. The core problem with copyright is that enforcement of it requires monitoring of communications, and you cannot be guaranteed free speech if someone is monitoring everything you say. This is important, most people fail to see or address this point when debating the issue of copyright, so let me make it clear:
ru: Конечно, вопрос об авторском праве во Freenet вызвал много внимания со стороны общества, в связи с этим я коротко скажу свое мнение на этот счет.Основная проблема с авторским правом заключается в том, что для его соблюдения необходимо мониторить коммуникации. Таким образом не возможна гарантия свободы слова, если кто-то следит за всем, что вы говорите. Это важно, большинство людей не видят или не берут во внимание этот момент при обсуждении вопроса об авторском праве. Поэтому позвольте мне прояснить:

source: <em>You cannot guarantee freedom of speech and enforce copyright law</em>
ru: <em>Вы не можете гарантировать свободу слова и применять закон об авторском праве.</em>
