Repository: Bombe/hyphanet-website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: ru, zh_tw

source: ### David Sowder David (Zothar) has helped the Freenet Project as time permits and interest directs, including configuration, statistics and peer management via FCP, the FProxy stats page and Node 2 Node Messages (N2NM/N2NTMs). And **hundreds of others**, who either haven't asked to be added here, who prefer to remain nameless, or who we just haven't got around to thanking. Not to mention thousands of users, testers, and [donors](donate.html#sponsors)!
zh_tw: ### David Sowder David (Zothar) 抽空在 Freenet 專案上幫了不少忙。其中包括配置、通過 FCP 的節點管理和統計、FProxy 統計頁面以及點對點訊息（N2NM/N2NTM）。 還有**上百人**，沒有將自己的名字列在這裡。他們要不沒有說出自己的名字，要麼我們來沒來得及感謝。更別提還有上千使用者、測試者和[捐助者](donate.html#sponsors)！

source: Papers
zh_tw: 論文

source: ![][icon_pdf] [Measuring Freenet in the Wild: Censorship-resilience under Observation](assets/papers/roos-pets2014.pdf) (PDF) Observations and measurements on the live Freenet network. Includes suggestions for improvement. This was submitted to PETS 2014.
zh_tw: ![][icon_pdf] [Measuring Freenet in the Wild: Censorship-resilience under Observation](assets/papers/roos-pets2014.pdf) (PDF) 研究觀測 Freenet 網絡，提供了改進建議。這篇論文被提交到了 PETS 2014。

source: ![][icon_pdf] [The Dark Freenet](assets/papers/freenet-0.7.5-paper.pdf) (PDF) Detailed paper about the Freenet 0.7.5 network, as opposed to its routing algorithm, which is detailed in the below papers. Includes some new simulations. This has been submitted to PET 2010.
zh_tw: ![][icon_pdf] [The Dark Freenet](assets/papers/freenet-0.7.5-paper.pdf) (PDF) 關於 Freenet 0.7.5 網絡細節的論文，其中不包括它的路由算法（下面的論文中有）。論文包括一些新的模擬實驗。這篇論文被提交到了 PET 2010。

source: ![][icon_video] [Video of Small World talk, Berlin, December 2005](http://player.vimeo.com/video/22488244?title=0&byline=0&portrait=0) This is a video of a talk given by Ian Clarke and Oskar Sandberg at the Chaos Computer Congress in Berlin, December 2005, describing the (then) new architecture for Freenet 0.7\. You can also download the [slideshow]( assets/papers/ccc-slideshow.pdf.bz2), and the source for the Java [demo]( assets/papers/ccc-freenet-demo.tar.bz2) (requires Java 1.5).
zh_tw: ![][icon_video] [Video of Small World talk, Berlin, December 2005](http://player.vimeo.com/video/22488244?title=0&byline=0&portrait=0) 此視頻是2005年12月在柏林的 Chaos Computer 大會上，Ian Clarke 和 Oskar Sandberg 發表的演講。這個演講描述了（當時）全新的 Freenet 0.7 架搆。您也可以下載演講使用的[幻燈片]( assets/papers/ccc-slideshow.pdf.bz2)，以及[演示]( assets/papers/ccc-freenet-demo.tar.bz2) 的 Java 源代碼（需要 Java 1.5）。

source: ![][icon_pdf] [Searching in a Small World](assets/papers/lic.pdf) (PDF) Oskar Sandberg's licentiate thesis describing a simple decentralized mechanism for constructing small world networks that is inspired by Freenet's original design. Part II of the thesis describes the basis for the new Darknet architecture.
zh_tw: ![][icon_pdf] [Searching in a Small World](assets/papers/lic.pdf) (PDF) Oskar Sandberg 的博士論文描述了一個簡單的去中心化的機制，來搆建一個小世界網絡。此論文給 Freenet 最初的設計帶來了靈感。論文的第二部分描述了新的暗網架搆的基礎。

source: ![][icon_pdf] [Distributed routing in Small World Networks](assets/papers/swroute.pdf) (PDF) A paper by Oskar Sandberg describing the theoretical basis for the new "Darknet" routing mechanism employed by Freenet 0.7.
zh_tw: ![][icon_pdf] [Distributed routing in Small World Networks](assets/papers/swroute.pdf) (PDF) Oskar Sandberg 的論文描述了新的「暗網”路由機制的理論基礎。Freenet 0.7 釆用了它。

source: ![][icon_pdf] Chaos Computer Congress Talk (slideshow) This is a [slideshow](assets/papers/ccc-slideshow.pdf.bz2) for a talk given at the Chaos Computer Congress on 30th Dec 2005 in Berlin, Germany by Ian Clarke and Oskar Sandberg. It described the new "darknet" approach to be employed in Freenet 0.7\. A Java demonstration to accompany the talk is [ also](assets/papers/ccc-freenet-demo.tar.bz2) available.
zh_tw: ![][icon_pdf] Chaos Computer Congress Talk (幻燈片) 這是2005年12月30日在德國柏林的 Chaos Computer Congress 大會上 Ian Clarke 和 Oskar Sandberg 演講所使用的[幻燈片]。它描述了（當時）即將在 Freenet 0.7 中引入的「暗網”模式。演講配套的 Java 演示程序可以[在這里下載](assets/papers/ccc-freenet-demo.tar.bz2)。

source: ![][icon_pdf] [Switching for a small world](assets/papers/vilhelm_thesis.pdf) (PDF) A thesis by Vilhelm Verendel exploring ways to optimise the swapping algorithm.
zh_tw: ![][icon_pdf] [Switching for a small world](assets/papers/vilhelm_thesis.pdf) (PDF) Vilhelm Verendel 的論文探索了優化交換算法的途徑。

source: ![][icon_pdf] [Protecting Freedom of Information Online with Freenet](assets/papers/freenet-ieee.pdf) (PDF) An IEEE Internet Computing article describing the Freenet architecture circa 2002 - probably the best introduction to the theory behind Freenet.
zh_tw: ![][icon_pdf] [Protecting Freedom of Information Online with Freenet](assets/papers/freenet-ieee.pdf) (PDF) 這是一篇 2002 年左右《IEEE Internet Computing》的文章，描述了 Freenet 的架搆。這可能是對 Freenet 背后理論的最好介紹。

source: ![][icon_pdf] [FreeNet White Paper](assets/papers/ddisrs.pdf) (PDF) Original white paper by Ian Clarke, Division of Informatics, University of Edinburgh 1999.
zh_tw: ![][icon_pdf] [FreeNet White Paper](assets/papers/ddisrs.pdf) (PDF) 這是 Ian Clarke 於 1999 年在英國愛丁堡大學信息學系撰寫的白皮書原稿。

source: ![][icon_pdf] [Attack Resistant Network Embeddings for Darknets](http://www.ukp.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/publications/Attack_Resistant_Network_Embeddings_for_Darknets.pdf) (PDF) A proposal for changing the darknet swapping algorithm which we are still considering (we have some doubts about long-term performance).
zh_tw: ![][icon_pdf] [Attack Resistant Network Embeddings for Darknets](http://www.ukp.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/publications/Attack_Resistant_Network_Embeddings_for_Darknets.pdf) (PDF) 我們目前正在考慮的一篇關於修改暗網交換算法的提議（我們有些懷疑該方式長期運行會影響性能）。

source: ![][icon_pdf] [A Contribution to Analyzing and Enhancing Darknet Routing](http://www.p2p.tu-darmstadt.de/publications/details/?no_cache=1&tx_bibtex_pi1%5Bpub_id%5D=TUD-CS-2013-0036) ([PDF](http://www.p2p.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/INFOCOM.pdf)) A proposal for changing the routing algorithm which we are still considering (the worst case performance i.e. when a block has been lost may be unacceptable).
zh_tw: ![][icon_pdf] [A Contribution to Analyzing and Enhancing Darknet Routing](http://www.p2p.tu-darmstadt.de/publications/details/?no_cache=1&tx_bibtex_pi1%5Bpub_id%5D=TUD-CS-2013-0036) ([PDF](http://www.p2p.tu-darmstadt.de/fileadmin/user_upload/Group_P2P/share/INFOCOM.pdf)) 我們正在考慮的一篇關於修改路由算法的提議（我們在考慮最壞的情況下的性能問題，也就是某個數據塊丟失或無法接受的情況）。

source: ![][icon_pdf] [Presentation: Towards "Dark" Social Networking Services (Strufe et al.)](https://www.icsi.berkeley.edu/icsi/sites/default/files/events/events_1303_strufe.pdf) (PDF) An interesting presentation by the group responsible for the two above papers.
zh_tw: ![][icon_pdf] [Presentation: Towards "Dark" Social Networking Services (Strufe et al.)](https://www.icsi.berkeley.edu/icsi/sites/default/files/events/events_1303_strufe.pdf) (PDF) 來自上面兩篇論文團隊的一個有趣的幻燈演示。

source: ![][icon_pdf] [Pisces: Anonymous Communication Using Social Networks](http://arxiv.org/abs/1208.6326) An algorithm for setting up onion-like tunnels on darknets.
zh_tw: ![][icon_pdf] [Pisces: Anonymous Communication Using Social Networks](http://arxiv.org/abs/1208.6326) 一篇關於在暗網中設置類似 Tor 隧道的算法論文。

source: ![][icon_pdf] [Routing in the Dark: Pitch Black](http://grothoff.org/christian/pitchblack.pdf) ([citeseer](http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.117.1543)) (PDF) A paper describing some attacks on Freenet 0.7's location swapping algorithm. We have solutions for this but they are still being tested.
zh_tw: ![][icon_pdf] [Routing in the Dark: Pitch Black](http://grothoff.org/christian/pitchblack.pdf) ([citeseer](http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.117.1543)) (PDF) 這篇論文描述了一些對 Freenet 0.7 位置交換算法的攻擊方式。 我們對此已經有了解決方案，仍在測試中。

source: The most up to date reference is of course [the source code]( https://github.com/freenet/fred), but there is also some useful documentation on [the wiki](https://wiki.freenetproject.org/) (you may have to search a bit), and most implemented ideas have been discussed in detail on [the mailing lists](help.html#mailing-lists) at some point, more recently often in-Freenet forums such as FMS, or [the bug tracker](https://bugs.freenetproject.org/). [icon_pdf]: assets/img/small-n-flat/file-pdf.png [icon_video]: assets/img/small-n-flat/file-video.png
zh_tw: 最新的參考資料當然是[源代碼]( https://github.com/freenet/fred)，但是 [Wiki](https://wiki.freenetproject.org/) 中也有一些有用的文檔（您可能需要搜索一下）。而很多實現的想法細節也曾在[郵件列表](help.html#mailing-lists)中討論過。最近我們也經常在 Freenet 中的論壇（如 FMS），或是[Bug 跟蹤網站](https://bugs.freenetproject.org/)中討論。 [icon_pdf]: assets/img/small-n-flat/file-pdf.png [icon_video]: assets/img/small-n-flat/file-video.png

source: About
zh_tw: 關於

source: I'll be patient, I promise!
zh_tw: 我保證會有耐性

source: Please note
zh_tw: 請注意

source: This chat is staffed by volunteers, and it may be that no one is around right now. Please ask your question, and someone will answer within several hours.
zh_tw: 這個聊天由志願者組成，有時可能沒有人在線。請直接提出你的問題，其他人會在几個小時內答復。

source: Freenet rabbit logo
zh_tw: Freenet 兔子標志

source: Contact
zh_tw: 聯系我們

source: Press:
zh_tw: 媒體：

source: Support:
zh_tw: 用戶支持：

source: {irc_channel} on {irc_server}
zh_tw: {irc_server} 上的 {irc_channel} 頻道

source: License
zh_tw: 許可協議

source: Content on this website is licensed under the GNU Free Documentation License and may be available under other licenses.
zh_tw: 本網站上的內容可按照 GNU 自由文檔許可證及其他可適用的許可協議授權。

source: Design by DesignBootstrap
zh_tw: 網站設計 DesignBootstrap

source: Developers
zh_tw: 開發者

source: If you already have a contribution in mind you can find the project repositories [on GitHub](https://github.com/freenet/). - Get in contact in the [mailing lists](help.html#mailing-lists) - Join us on IRC: [#freenet on chat.freenode.net](help.html#irc) - Report issues in the [bug tracker](https://bugs.freenetproject.org/) The Wiki contains a list of [freenet-related projects](https://wiki.freenetproject.org/Projects) and documentation of the [Freenet Client Protocol](https://wiki.freenetproject.org/FCPv2) for using Freenet from external programs. We're happy to accept pull requests on GitHub as well as patches sent under a pseudonym through Freenet forums such as [FMS](http://freesocial.draketo.de/fms_en.html).
zh_tw: 如果你已經想好了要貢獻什麼，可以在 [GitHub](https://github.com/freenet/) 上找到 Freenet 的源碼庫。 - 通過[郵件列表](help.html#mailing-lists)聯絡我們 - 在 IRC 上加入：[#freenet on chat.freenode.net](help.html#irc) - 在[臭蟲記錄](https://bugs.freenetproject.org/)報告問題 Freenet Wiki 有一個 [相關項目列表](https://wiki.freenetproject.org/Projects)，以及 [Freenet 客戶端協議](https://wiki.freenetproject.org/FCPv2)文件。你可以藉助這些資料從外部程式使用 Freenet。 我們樂意在 GitHub 上接受合併請求，也樂於在 [FMS](http://freesocial.draketo.de/fms_en.html) 這樣的 Freenet 論壇上用假名發來的補丁。

source: Translation
zh_tw: 翻譯

source: Bug tracker
zh_tw: 臭蟲跟蹤系統

source: Contribute
ru: Вклад в проект
zh_tw: 貢獻

source: Documentation
zh_tw: 文檔

source: The documentation on Freenet is forever changing, since this is a project in development. However, here under the Documentation menu, you may find usage documents on how to setup Freenet and use the most popular Freenet tools as well as a user driven Wiki and an extensive Frequently Asked Questions department. * [**Install**](#install) Contains detailed instructions on how to install Freenet using the new installer. * [**Connect**](#connect) How to connect to Freenet. * [**Content**](#content) Freenet as a Content Distribution System. * [**Understand**](#understand) Explains the workings of Freenet, and a glossary with the most frequently used terms. * [**Social**](#social) How to setup email, forums and microblogging over Freenet. * [**jSite**](#jsite) jSite is a Freenet website (a.k.a. Freesite) insertion tool. * [**Wiki**](https://wiki.freenetproject.org/) The Freenet Wiki is a user driven space where new features may be described before finding their way into the website. It is a good source of information about all sorts of Freenet related issues.
zh_tw: Freenet 的開發是持續進行的，它的文檔也在不斷 更新。在本頁面您可以閱讀它的各種文檔資源，包括：如何 安裝設置 Freenet；如何使用最流行的 Freenet 工具； 以及如何訪問 Freenet 用戶貢獻的 Wiki 站點和詳盡的常見問題解答。 * [**安裝**](#install) 詳盡的 Freenet 安裝指南（使用全新安裝程序）。 * [**連接**](#connect) 如何連接到 Freenet。 * [**內容**](#content) 如何使用 Freenet 發布您的內容。 * [**理解**](#understand) 解釋 Freenet 是如何工作的，以及對常見屬於的解釋。 * [**社交**](#social) 如何設置 Freenet 上的 Email、論壇和微博。 * [**jSite**](#jsite) jSite 是 Freenet 網站 (也稱為 Freesite) 插入工具。 * [**Wiki**](https://wiki.freenetproject.org/) Freenet Wiki 是用戶自發貢獻的文檔的集散地。一些新功能文檔會首先在 Wiki 上出現，然后才會被整理到本站。這里是 Freenet 所有相關問題的信息來源。

source: Install
zh_tw: 安裝

source: To install Freenet might not be as difficult as you might have heard. There are three ways to install Freenet: * Graphical install * Headless install * Enabling a mirror copy of a Freenet installation If you want to install the Freenet software on a computer which lacks a GUI, see the [Headless install](download.html#unix) instructions. If you have mirrored a working Freenet installation to a machine without explicitly installing it, see [Mirrored install](download.html#mirrored). Otherwise, continue reading.
zh_tw: 安裝 Freenet 並不困難。安裝 Freenet 有三種方式： * 圖形界面安裝 * 無外設安裝 * 複制一個已安裝的 Freenet 鏡像 如果您要在無圖形界面的操作系統下安裝 Freenet 軟件，參見[無外設安裝](download.html#unix)說明。如果您想複制一套安裝好的 Freenet 到另一台電腦，參見[鏡像安裝](download.html#mirrored)。如果不是上述兩種情況，請繼續閱讀本文。

source: #### Graphical install **The information below does not apply to Windows systems**. For Windows you should use [the installer for Windows](assets/jnlp/FreenetInstaller.exe) as described on [the download page](download.html). You can also get the installer for Windows from [here](https://downloads.freenetproject.org/latest/FreenetInstaller.exe). For a graphical installation you have to have: * a working Java Runtime Environment * a downloaded copy of [new_installer_offline.jar](assets/jnlp/freenet_installer.jar) (if this does not work try [here](https://downloads.freenetproject.org/latest/new_installer_offline.jar)) * a working graphical user interface (GUI) You should save the new_installer.jar file somewhere where you can find it again. Your home-directory should be a good place. The next step requires you to know where you stored the file (the path to it), so it is quite important that you do that step thoroughly.
zh_tw: #### 圖形界面安裝 **下述內容在 Windows 系統下已經過時**。Windows 下您應該使用[Windows 安裝程序](assets/jnlp/FreenetInstaller.exe)安裝，參見[下載頁面](download.html)。您也可以在[這里下載](https://downloads.freenetproject.org/latest/FreenetInstaller.exe) Windows 安裝程序。 要進行圖形界面安裝，您需要有： * 一個可以正常工作的 Java 運行庫； * 最新版本的離線安裝 jar 文件 [new_installer.jar](assets/jnlp/freenet_installer.jar) （如果前面的鏈接無法下載，可以試試[這個鏈接](https://downloads.freenetproject.org/latest/new_installer_offline.jar)） * 一個圖形化用戶界面（GUI） 您應該將 new_installer.jar 保存到一個可以找到的地方，譬如您的下載目錄。下一步您需要找到這個文件（知道其路徑），因此這個步驟很重要。

source: To start the installation, open a command line interface/terminal/shell window. Exchange the **/path/to** to the real path (for example: /home/username/download/new_installer.jar) to the new_installer.jar-file and type: <pre> $ java -jar /path/to/new_installer_offline.jar</pre> The first window you should see is the one below, which allows you to select your preferred language for the installation program. ![](assets/img/install/1-langselect.png) Next is shown an about-box, some information about the version of Freenet and authors. Just click **Next** to proceed. ![](assets/img/install/2-about.png) The next step is to choose the directory in which to install Freenet. The default location on GNU/Linux & POSIX operating systems is **/home/username/Freenet** as shown below. Change it to something appropriate or leave "as is". Click **Next** when you are finished. ![](assets/img/install/4-Install_directory.png) Select the packages that you want to install with your Freenet software. Since it takes up virtually no extra disk-space, it is recommended that you leave all packages selected and press **Next**. ![](assets/img/install/5-select_packages.png) In the next stage, the packages are installed, and a progress meter runs across the window. When it is finished, press **Next** to continue to the next step. ![](assets/img/install/6-Install_packages.png) After that, the Freenet software is installed and/or upgraded, plugins are enabled and the environment is started. When completed, press **Next** to proceed. ![](assets/img/install/7-install_progress.png) For some graphical environments, shortcuts in the menu-structure can be created. This is not the case for all of the platforms that Freenet run on. However, there should be created shortcuts on the desktop in all supported environments. Change the application group according to your needs and press **Next** when finished. ![](assets/img/install/8-create_shortcuts.png) After that, the installation is finished. Click **Done** to close the window. ![](assets/img/install/9-Install_finished.png) If all has gone well, a browser window should have opened in the background. This will ask you a bunch of questions to configure Freenet, and then you should be able to use it.
zh_tw: 要開始安裝，您需要打開命令行提示符/終端/Shell 窗口。運行命令時，請將命令中的 **/path/to** 替換為 new_installer.jar 文件的真實路徑（例如：/home/username/download/new_installer.jar）然后輸入下面的命令： <pre> $ java -jar /path/to/new_installer_offline.jar</pre> 首先彈出的窗口讓您選擇安裝程序的語言。 ![](assets/img/install/1-langselect.png) 接下來會顯示關於對話框，顯示一些 Freenet 版本和作者的信息。點擊 **Next** 繼續。 ![](assets/img/install/2-about.png) 下一步選擇 Freenet 的安裝目錄。GNU/Linux 和 POSIX 操作系統的默認安裝目錄是 **/home/username/Freenet**，如下圖所示。您可以根據需要修改，或者直接點擊 **Next** 按鈕。 ![](assets/img/install/4-Install_directory.png) 選擇您要安裝的 Freenet 組件。因為選擇更多的組件不會使用額外的磁碟空間，建議您全部選擇。完成后點擊 **Next**。 ![](assets/img/install/5-select_packages.png) 下一步，安裝開始。當進度條走完，點擊 **Next** 來到下一步。 ![](assets/img/install/6-Install_packages.png) 完成后，Freenet 便安裝或升級完成，插件會自動啟用，Freenet 會自動開始運行。完成后，點擊 **Next** 繼續。 ![](assets/img/install/7-install_progress.png) 在一些圖形環境，可以創建菜單，不是所有環境都支持這一點。但是 Freenet 可運行的圖形環境都支持創建桌面快捷方式。根據您的需要修改應用程序組，然后點擊 **Next** 按鈕。 ![](assets/img/install/8-create_shortcuts.png) 安裝完成！點擊 **Done** 按鈕關閉窗口。 ![](assets/img/install/9-Install_finished.png) 如果一切正常，一個新的瀏覽器窗口會打開。打開的頁面會詢問您一些問題來配置 Freenet，之后您就可以正式開始使用 Freenet 了。

source: It will ask about network security level - "protection from strangers attacking you over the internet". If you choose LOW or NORMAL, Freenet should "just work", connecting in a few minutes. If you choose HIGH or MAXIMUM, Freenet will need you to add friends before you can use it. These must be people you personally know. Adding people you don't know will not improve security.
zh_tw: 其中有一個問題是關於網絡安全級別的 —— ”protection from strangers attacking you over the internet“（對陌生人通過網路攻擊的保護）。如果您選擇「低「或「中”，Freenet 應該「可以工作”了，需要等待數分鐘連接到網絡。如果您選擇「高”或「最高”，您需要添加几個好友才能使用 Freenet。這些好友必須是您真實認識的。添加那些您不認識的人為好友不會提高安全性。

source: Connect
zh_tw: 連接

source: There are two ways to connect to Freenet: * You can enable insecure mode (the installation wizard will ask you) and Freenet will automatically find nodes to connect to - Strangers. * You can connect to nodes run by people you know - Friends. Note that these should be people you actually know on some level, in order to maintain good network topology and maximum security. In practice, you should probably use both of these options, unless you are really paranoid, in which case you should of course only connect to people you trust. Insecure mode should work automatically once enabled, so the rest of this page is about connecting to Friends. To connect to your friends' nodes, you have to exchange Node references with them. The references must be added on **both sides** to be established. That is, you need to add his/hers, and he/she needs to add yours.
zh_tw: 有兩種方式連接到 Freenet： * 您可以啟用非安全模式(安裝向導會詢問您)，Freenet 就會自動查找並連接到陌生人。 * 您可以連接到您認識的人運行的節點——好友。請注意他們應當是您比較熟識的人，以維護好的網絡拓補和保證最大的安全性。 實踐中，兩種模式是混合的，除非您比較偏執。非安全模式啟用後會自動工作，因此接下來我們會主要介紹如何連接到好友。 要連接到您好友的節點，您需要與他們互相交換節點信息。節點信息必須**雙方**都要添加，連接才能建立。也就是，您要添加對方的節點信息，對方也要添加您的節點信息。

source: *When you have a freshly connected node, you have no data cached in your datastore, and very few connections even if insecure mode is enabled. Requests are sent out in a random fashion. **This makes some (or all) requests time out before retrieving anything.** It takes a couple of days for your Freenet node to get up to speed, so please don't get discouraged by this.* You should have at least three nodes that are connected to you at all times, ideally at least five to seven. Since some nodes may be unreachable at times, you need to connect to some more nodes to get the expected number. The nodes that are connected directly to you are the only nodes on Freenet that might see what kind of traffic passes through to your Freenet node. But if insecure mode is enabled, any node can find yours; this is the big advantage of **not** enabling insecure mode: you are effectively invisible except to your friends. In practice most people start off with insecure mode and gradually add friends, and hopefully turn off insecure mode once they have at least 10 friends.
zh_tw: *對於一個全新安裝的 Freenet，您的數據存儲中不會有任何數據，即使非安全模式啟用，連接數也會很少。請求是隨機發出的。**這會導致某些(或全部)請求在還未獲取數據前便超時。**數天后，您的 Freenet 節點的速度才會變得正常，因此請勿沮喪。* 您應當至少保證隨時有 3 個節點連接，5 到 7 個連接是更理想的。因為某些節點有時無法連接，您需要添加更多的節點以保證連接數。只有那些直接與您的 Freenet 節點連接的節點才有可能偵測到通過您的節點的數據。但是如果非安全模式啟用，任何節點都有可能偵測到。這就是**不啟用**非安全模式的最大優點：您可以有效的隱身，只有您的好友知道。實踐中很多人始於非安全模式並逐漸添加好友。當他們擁有超過 10 位好友時，關閉非安全模式

source: ![](assets/img/Freenet-architecture-small.png) *Figure 1: Visible Freenet connections* **Node A** in the figure also has a number of nodes connected to it, but they are all (except from your own node) invisible to you. The traffic routing algorithm is therefore only able to direct traffic to one of the few nodes that you know of that it thinks is most able to find what you are looking for. The traffic is encrypted, so it is quite difficult for the nodes that you connect to to see what your Freenet traffic consists of, but it is far from impossible. It is therefore important that you connect only to people you know. If that is not possible, then at least people you've talked to. There are a number of ways to add peer node references.
zh_tw: ![](assets/img/Freenet-architecture-small.png) *圖表 1: 可見的 Freenet 連接* 圖表中，一些其他的節點連接到**節點 A** ，但是這些節點您都看不到。(您只能看到與自己的節點建立連接的節點。)流量路由算法因此僅會在與您建立連接的節點中尋找最合適的節點獲取數據。 傳輸的數據是加密的，因此與您連接的那些節點很難了結到您的 Freenet 節點到底獲取了哪些數據，但是這并不是完全不可能的。所以您只能連接到您認識的人，這非常重要。如果很難實現，至少與那些您說過話的人建立連接。 有數種方式添加他人的節點信息。
