Repository: Bombe/hyphanet-website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: ru, zh_tw

source: ### So it's running, what do I do? When the installer closes, it should open a browser window pointing to the first-time wizard. Here you can configure basic settings, and then start using Freenet. You can access Freenet later on via the system tray menu ( bottom right on the screen), or use the Browse Freenet shortcut on the desktop and/or start menu. If it doesn't work, open [http://127.0.0.1:8888/](http://127.0.0.1:8888/) in your web browser. For best security you should use a separate browser for Freenet, preferably in privacy mode. On Windows, the system tray menu will try to use Chrome in incognito mode if possible. Internet Explorer does not work well with Freenet, Firefox and Opera are widely used. If you know anyone running Freenet, you can improve your security and help to build a robust network by connecting to their node. First, open the [Add a friend page](http://127.0.0.1:8888/addfriend/). You and your friend should each download their "node reference". Send the file to the other person, and add his node reference using the form at the bottom of the page. When both are added, your friend's node should show up on the Friends page, probably as "CONNECTED" or "BUSY". You can set a name for your node on the config page to make it easier to see who it is. Only add nodes run by people **you actually know**, whether online or offline, as adding total strangers harms performance and does not improve security much (they could be the bad guys!).
zh_tw: ### 運行起來了，接下來該做什么？ 安裝程序關閉后，會彈出一個新的瀏覽器窗口，打開初次運行向導頁面。以后您可以通過桌面右下角的系統托槃圖標，或是桌面/開始菜單中的「瀏覽 Freenet”快捷方式訪問 Freenet。如果這些無法正常工作，您可以在瀏覽器里訪問網址：[http://127.0.0.1:8888/](http://127.0.0.1:8888/)。 為了保證盡可能的安全，您應當單獨使用一個瀏覽器訪問 Freenet，最好使用隱私瀏覽模式。在 Windows 下，系統托槃圖標會嘗試使用 Chrome 的 Incognito 模式瀏覽 Freenet。Freenet 在Internet Explorer 下運行不是特別完美，建議使用 Firefox 或谷歌瀏覽器。 如果您知道其他人也在使用 Freenet，您可以連接他們的節點以提高安全性并有助於建立堅實的網絡。首先，打開[添加朋友](http://127.0.0.1:8888/addfriend/)頁面。您和您的朋友應該互相添加他們的「節點信息”。將節點信息文本發送給其他人，并使用頁面下方的表單添加對方發送給您的節點信息。雙方互相添加后，您的好友節點應當顯示在好友頁面，狀態可能為「已連接”或「繁忙”。您可以在配置頁面為您的節點設置一個名稱，這樣其他好友更容易知道您是誰。請只與您確實認識的人互相添加好友，不管他們在線還是離線。添加陌生人為好友會影響性能，而且并不能提高安全性。（他們可能是壞人！）

source: ### So I'm connected, what do I do? Freenet itself includes anonymous websites ("freesites"), filesharing, searching, and more, but you can also use third party applications for chat, filesharing, to help you upload freesites, etc. The [Freenet Social Networking Guide](http://freesocial.draketo.de/) explains how to set up the main third party tools, including email, forums and micro-blogging (Sone, a bit like twitter).
zh_tw: ### 我連上了，接下來該做什么？ Freenet 自帶很多匿名網站（Freesites）、文件分享、搜索等資源，但是您也可以使用第三方應用程序來聊天、分享文件、幫助您上傳 Freesite 等。 [Freenet 社交網絡指南](http://freesocial.draketo.de/)向您介紹了如何配置主要的第三方工具，包括 Email，論壇和微博（Sone，有點像 Twitter）。

source: ### It doesn't work, now what? If you have problems installing or running Freenet, please see the [knowledge base][kb_url], [FAQ][faq_url], [chat][chat_url], or [mailing list][ml_url].
zh_tw: ### 用不了，咋辦？ 如果你安裝、執行 Freenet 時遇到問題，請參考[知識庫][kb_url]、[FAQ][faq_url]、[聊天][chat_url]或[電子報][ml_url]。

source: ### Hardware requirements Generally a 1GHz processor and 1GB of RAM should be fine. Freenet will run on smaller systems, but it uses at least 128MB of RAM, so unless the system does nothing else it will struggle in less than 512MB. However, the processor is less of a problem, people have been known to run it on 400MHz Pentium 2's or ATOM's, although downloads and browsing would be slow. Freenet will use a portion of your disk for storing data, you can configure this to any size from 100MB upwards, but we recommend at least 1GB. Freenet also uses disk space for your downloads. Freenet's memory usage is approximately 256MB plus 400kB for every 2GB of datastore. On 64-bit Windows, we will install a 32-bit Java Virtual Machine because of limitations of the [Java Service Wrapper]( http://wrapper.tanukisoftware.org/doc/english/download.jsp).
zh_tw: ### 硬件需求 一般來說 1GHz 的處理器和 1GB 內存就足夠了。在配置更低的硬件下 Freenet 也能正常運行，但是它至少需要 128MB 內存，因此除非此硬件是專門運行 Freenet 的，否則內存低於 512MB 后整體運行會很卡。但是，處理器的要求就低多了，我們已知有人在 400MHz 的奔騰2 或 ATOM 處理器下成功運行 Freenet，雖然這種情況下下載和瀏覽會有些慢。 Freenet 會使用一些磁槃空間來儲存數據，您可以配置為 100M 以上的空間。但是我們強烈建議您分配至少 1G 空間給 Freenet。如果您從 Freenet 下載文件，這些文件也會占用磁槃空間。Freenet 的內存占用大概為初始 256MB，每 2GB 磁槃空間占用，會多占用 400kB。 在 64 位 Windows 中，我們會安裝 32 位的 Java 虛擬機。這是 [Java Service Wrapper]( http://wrapper.tanukisoftware.org/doc/english/download.jsp) 的限制造成的。

source: ### Upgrading Freenet provides an upgrade-over-Freenet mechanism: It will keep itself up to date automatically from other Freenet nodes, and this will normally work even if it is unable to route to them due to them being too new. This is anonymous and secure, and we recommend people use it. However, if something is severely broken, you can upgrade your node manually from our servers: * Windows users can upgrade to the latest-stable Freenet release by running "update.cmd" in the Freenet directory. * OS X, GNU/Linux, or other POSIX users may upgrade by running the update.sh shell script in the Freenet directory.
zh_tw: ### 升級 Freenet 提供了通過 Freenet 網路自動升級的機制：它會自動從其他節點下載升級檔案，自動更新。即使您的 Freenet 版本過舊，無法正常通過其他節點路由，仍能夠自動升級。升級是匿名安全的，我們建議您使用這種方式。但是，如果出現嚴重問題，無法自動升級，您可以連線到我們的伺服器手動升級： * Windows 使用者可以點選系統托盤圖示相應的選單，或者執行 Freenet 安裝目錄下的“update.cmd”升級到最新穩定版本。 * OS X、GNU/Linux 或其他 POSIX 作業系統的使用者可以執行 Freenet 安裝目錄下的“update.sh”指令碼來升級。

source: Add friends (or connect to strangers)
zh_tw: 新增朋友(或是與陌生人聯繫)

source: If you know other people who also use Freenet, you can [add them as Friends][url_addfriend]. This will make you safer against attacks on Freenet Project infrastructure (the [seednodes][url_seednode_info]).
zh_tw: 如果你認識其它人也使用Freenet，你可以 [添加成為朋友][url_addfriend]. 這可以讓你在使用Freenet 基礎架構時更安全地防範攻擊 ( [種子節點][url_seednode_info]).

source: Once you are connected to 5 or more friends, you can enable **high security mode**. In high security mode Freenet will only connect to your friends. This makes your usage of Freenet almost undetectable, but you are still able to access the rest of the network through your friends' friends friends ....
zh_tw: 在您連線到5個或更多的朋友後，您可以啟用**高安全模式**。 在高安全模式下，Freenet 將只連線到您的朋友。 這將使您使用 Freenet 的情況幾近無法檢測，而您仍然可以通過您朋友的朋友訪問網路的其他部分。

source: You don't have to add friends right now. If you use a "low" or "normal" security level Freenet will automatically connect to strangers and will work just fine. However, your (or someone else's) government may be able to find out who you are with enough effort. Be careful!
zh_tw: 您不必現在就新增好友。 如果您使用“低”或者“正常”安全級別，Freenet 將自動連線到陌生人，並且也工作良好。 但是，您（或者別人）的政府或許有能力精確找出你是誰。萬事小心！

source: Verifying Signatures
zh_tw: 認證簽名

source: Download the [Freenet Project signing keys][url_keyring] and import them into your keyring:
zh_tw: 下載 [Freenet 簽名公鑰][url_keyring] 並將其匯入至您的金鑰環：

source: FAQ
zh_tw: 常見問題

source: Philosophical
zh_tw: 哲學

source: Freenet is a platform for censorship-resistant communication and publishing. It is designed to ensure true freedom of communication over the Internet. It allows anybody to publish and read information with complete anonymity. Nobody controls Freenet, not even its creators, meaning that the system is not vulnerable to manipulation or shutdown. Freenet is also very efficient in how it deals with information, adaptively replicating content in response to demand. For more information, see [What is Freenet?](about.html#introduction)
zh_tw: Freenet 是一個無法被任何個人或者組織審查的通訊和內容發布平台。它被設計成能夠確保通過互聯網進行真正自由的溝通。它允許任何人完全匿名的發布和閱讀信息。無人控制 Freenet，甚至它的創造者也不能，這意味着這個系統沒有被操縱或關閉的風險。Freenet 也能夠非常有效率的處理信息，根據需求自適應地復制內容。要了解更多信息，參見《[什么是 Freenet?](about.html#introduction)》一文。

source: How is Freenet different to Tor? Can I access Google/Facebook/etc through Freenet?
zh_tw: Freenet 與 Tor 有何不同？我可以使用 Freenet 訪問 Google、Facebook 等網站嗎？

source: Freenet is a self-contained network, while Tor allows accessing the web anonymously, as well as using "hidden services" (anonymous web servers). Freenet is not a proxy: You cannot connect to services like Google or Facebook using Freenet. However, Freenet has websites, filesharing, forums, chat, microblogging, email etc, all anonymous and hosted within Freenet. Freenet is a distributed datastore, so once content is uploaded to Freenet, it will remain on Freenet forever, as long as it remains popular, without fear of censorship or denial of service attacks, and without needing to run your own web server and keep it online constantly. The other big difference is that Freenet has the "darknet" or Friend to Friend mode, where your Freenet node (software on your computer) only connects to the Freenet nodes run by your friends, i.e. people you know (and maybe to their friends, to speed things up). This makes blocking Freenet, e.g. on a national firewall, extremely difficult.
zh_tw: Freenet 是一個獨立封閉的網絡，而 Tor 允許匿名訪問 Web，以及使用「隱藏服務”（匿名 Web 服務器）。Freenet 不是一個代理服務器：您不能使用 Freenet 連接到 Google 或 Facebook 等服務。但是，Freenet 有自己的網站、文件分享、論壇、聊天、微博、Email 系統等。所有這些服務都是匿名的存在於 Freenet 網絡中。 Freenet 是一個分布式數據存儲，因此一旦內容上傳到 Freenet，只要它有人訪問，就會永遠存在於 Freenet 中，不怕內容審查或拒絕服務攻擊，也不需要自己搭建服務器并保持在線。 另一個很大的不同是 Freenet 有自己的「暗網”，也稱為好友對好友模式。在這個模式下，您的 Freenet 節點（安裝在您電腦中的 Freenet 軟件）只會連接到您的好友的 Freenet 節點，也就是連接到您認識的人（根據設置，還可以連接到他們的好友節點，以提高速度）。這使得封鎖 Freenet（比如通過國家防火牆封鎖）几乎是不可能的。

source: However, most people currently use Freenet in "opennet" mode (that is, connecting automatically to whoever the network assigns, rather than connecting only to their friends). This is much less secure than using Freenet in "darknet" mode, and is relatively easy to block, as it does have some central servers ("seed nodes"). Freenet has many unsolved problems, and is still experimental. Our objective for Freenet is to build a global friend-to-friend darknet, which would be extremely difficult to block, and would provide very strong anonymity and censorship resistance. This will require further work on Freenet, on usability, speed and security, but above all it is a techno-social experiment: Will people know enough friends who are willing to use Freenet to make such an anonymous friend-to-friend network possible? This is why Freenet supports "opennet" mode: to let people try it out before they ask their friends to connect. Tor is a little less experimental, and arguably is an easier problem; it may provide better anonymity today, provided that it isn't blocked, and of course, Tor lets you access the internet as a whole, whereas on Freenet you can only access Freenet content. However if you can use a large enough darknet, Freenet already provides an interesting level of censorship resistance, DoS resistance and anonymity.
zh_tw: 但是，目前大多數人都在「Opennet”模式下使用 Freenet（他們的 Freenet 連接到網絡自動分配的節點，而不是他們的好友）。這種方式遠沒有 Freenet 的「暗網”模式安全，很容易被封禁，并且也需要一些中心化的服務器（“種子節點”）。 Freenet 還有許多未解決的問題，仍然處於試驗階段。我們對 Freenet 的目標是建立一個全球的好友對好友的暗網，很難被封禁，有着極強的匿名能力，能夠抵御內容審查。這需要更多的工作來完善 Freenet 的易用性、性能和安全性。但是更重要的是，這是一個科技社會的試驗：人們是否認識足夠的好友，願意使用 Freenet 來建立這個好友對好友的網絡？這就是為什么 Freenet 也同時支持「Opennet”模式：讓更多的人在推荐其好友連接之前自己先試試看。 Tor 沒有那么多的試驗性質，是一個相對容易論證的問題。只要它不被封，它在今日能夠提供更好的匿名性（相對於 Freenet 的「Opennet”模式）。另外 Tor 還可以讓您訪問整個互聯網，而使用 Freenet 您只能訪問 Freenet 網絡的內容。但是如果您可以訪問整個 Freenet 暗網，現階段的 Freenet 已經能夠提供非常出色的反內容審核、抵御拒絕服務攻擊和匿名的能力。

source: Using the internet "anonymously" is not necessarily easy: Connecting to Facebook through Tor doesn't prevent Facebook from knowing pretty much everything about you, and connecting to your (non-HTTPS) webmail account through Tor may mean the person running the proxy ("exit node") can steal your webmail account password. Freenet is a separate network, which does things differently, because there are no central servers. This is why we don't support Javascript, server-side scripting etc on freesites: Everything must be rewritten to work on a distributed network. But the advantage is there is no single server which can be compelled to hand over your private communications or which can be shut down. There are still risks, for example, talking about your home town or internet provider on an anonymous forum, or downloading files which Freenet can't make safe such as PDFs or word processor documents (Freenet will warn you about this). Also, for web content in particular, it may be easier to upload it to Freenet than set up a hidden server on Tor; you don't need to keep your node online for your content to be available, you don't need to figure out how to configure it safely, and most important, if you go away your site will still be available.
zh_tw: 在互聯網上實現絕對的「匿名性”并不是那么容易：您可以通過 Tor 連接到 Facebook，但是這并不能阻止 Facebook 了解您的一切。如果您通過 Tor 訪問您的（非 HTTPS）Web 郵箱，那么運行 Tor 代理服務器（“出口節點”）的人就可以截取您 Web 郵箱的帳號和密碼。 Freenet 則是一個獨立的網絡，做着完全不同的事情，因為它沒有中心化的服務器。這就是為什么對 Freesite 我們不支持 Javascript、服務器端腳本等：一切都必須重寫以使其工作在分布式網絡。但優點是，沒有任何一台服務器可以泄露您的隱私通訊，也無法被關閉。 當然即使有這些保護，危險仍然是存在的。例如，在匿名的論壇談論您的家鄉或 ISP，或者下載那些染毒的 PDF 或 Word 文檔（Freenet 會警告您下載它們存在風險）。 另外，對於普通網頁，上傳到 Freenet 比在 Tor 設置一個隱藏服務器更容易。您不需要保持自己的節點始終在線，也不需要擔心網站被攻擊，更重要的是，即使您離開，您的網站仍然可以訪問。

source: ### Summary: Tor (or I2P): * Lets you access the Internet (but be careful!). * Lets you access anonymous web servers and other services. * Lets you host anonymous web servers, which need to be kept online, and can be DoS'ed, but can run any dynamic or server-side content you want. * Provides reasonable anonymity * Has been blocked by several countries, with varying success. Even its hidden bridges can be harvested and blocked with moderate effort. * Is somewhat centralised * Is more mature and has more users and developers
zh_tw: ### 總結： Tor（或者 I2P）： * 讓你可以訪問互聯網（但要小心）。 * 讓你訪問匿名的網頁服務器和其他服務。 * 讓你匿名托管網頁服務器，但服務器必須保持在線，并且可能被 DoS 攻擊。但服務器可以運行您需要的任何動態或者服務端的內容。 * 提供合理的匿名性 * 已被數個國家封禁，有着不同的連接成功率。它們的網橋也可以通過一定的努力被抓取并封禁。 * 部分中心化 * 更成熟，有更多的用戶和開發者

source: Freenet in general: * Only lets you access content uploaded to Freenet, including (static) websites, email, filesharing, forums, microblogging, etc. All of which are anonymous (or pseudonymous i.e. you create an untraceable identity). * Hosts content in a distributed way: You don't know what your node is storing, any given content is distributed across many nodes. * Ensures that popular content will be available forever. * Is older than Tor, but more experimental (arguably it's a harder task).
zh_tw: Freenet 在兩種模式下都： * 只允許您訪問已上傳到 Freenet 的內容，包括（靜態的）網站、電子郵件、文件共享、論壇、微博等，所有一切都是匿名的（或者筆名，即創建一個難以追蹤的身份）。 * 托管內容是分布式的：您不知道你的存儲節點在哪，任何內容均分布在多個節點。 * 確保了流行的內容可以永遠存在。 * 早於 Tor，但帶有更多的實驗性質（可以說這是一個更艱巨的任務）。

source: Freenet in darknet mode: (friend to friend: connects only to your friends' nodes) * Is very hard to block, and this can be improved further with transport plugins. * Provides good anonymity, and with a bit more work it could provide very strong anonymity (PISCES tunnels). * Is fully decentralised: No central servers at all.
zh_tw: Freenet 在暗網模式：（好友到好友，只連接您好友的節點） * 非常難以封禁，并且這可以通過 Transport 插件進一步提高。 * 提供不錯的匿名性，并且未來可以實現非常強的匿名性（PISCES 隧道）。 * 完全分布式：沒有任何中心化服務器。

source: Freenet in opennet mode: (connect automatically even if you don't know anyone on Freenet) * Is relatively easy to block. * Provides limited anonymity * Is somewhat centralised
zh_tw: Freenet 在 Opennet 模式（即使您不認識使用 Freenet 的人仍可自動連接） * 比較容易被封禁 * 提供有限的匿名性 * 部分中心化

source: Unfortunately most people use Freenet in opennet mode currently. The big question is can we build a global friend-to-friend darknet? Join us and find out!
zh_tw: 遺憾的是，大多數使用 Freenet 的人目前運行在 Opennet 模式。一個重大的問題是，我們能否建立一個全球最大的好友到好友的暗網嗎？加入我們并找出方法吧！

source: PS for an example of how dependant Tor is on centralised hidden services, see [this](http://www.twitlonger.com/show/n_1rlo0uu) [bust](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/). Half the hidden services on Tor were using a single hosting service, whose owner has now been arrested. While we don't approve of these sites, it does illustrate the point: A centralised network is a vulnerable network. Unfortunately, decentralised networks are hard, but in the long run they are more secure.
zh_tw: 順帶提一下，Tor 依賴於集中式的隱藏服務的例子參見[這個](http://www.twitlonger.com/show/n_1rlo0uu) [事件](http://arstechnica.com/tech-policy/2013/08/alleged-tor-hidden-service-operator-busted-for-child-porn-distribution/)。Tor 上一半的隱藏服務使用單一的托管服務，它們的主人現在已經被捕。雖然我們不贊同這些網站，但它確實說明了一點：一個中心化的網絡是脆弱的網絡。遺憾的是，分布式網絡是艱難的。但從長遠來看，它們更加安全。

source: Who is behind Freenet?
zh_tw: 誰是 Freenet 的幕后人員？

source: Freenet grew out of a design for an anonymous publication system created by Ian Clarke while a student at the University of Edinburgh, Scotland. Since then many other people have contributed towards making Ian's proposal a reality.
zh_tw: Freenet 的前身是一個匿名發布系統，由一名學生 Ian Clarke 在愛丁堡大學創造。然后很多人都朝着他的貢獻來使其成為現實。

source: If authors are anonymous how can you trust information?
zh_tw: 如果作者是匿名的，我該怎么信任信息？

source: Cryptographic signing of information allows people to prove authorship, this technique is frequently used to authenticate authorship of emails. Moreover, you can actually sign information while remaining anonymous, thus having an anonymous persona. You can prove that you wrote different pieces of information on Freenet, without revealing your identity. In this way you can build up an anonymous reputation for reliability.
zh_tw: 加簽密文的資訊可讓人們證明其著作, 這種技術經常用於確認電子郵件上原送件者的真實性. 再者,你也可以匿名來簽署資訊,因此它有一個匿名者的選項 你可以證明在Freenet上面撰寫不同的資訊而不必揭露自己的身份 透過這個方法,你可以建立匿名信用的可信度.

source: Do I have to donate disk space and bandwidth?
zh_tw: 我必須貢獻磁槃空間和帶寬出來？

source: You aren't really donating in the sense that you lose the disk space and the bandwidth; but you aren't really sharing either (at least not the same way as with filesharing programs). It is more like pitching in to the common Freenet resource pool.
zh_tw: 你并沒有真正的捐出什么，你的磁槃空間和帶寬沒有丟失；你也并不是真正的在分享什么（至少與其他文件共享軟件不同）。它更像是為公用的 Freenet 資源池鋪路。

source: I don't have to donate anything when using filesharing application X and I get to leech more.
zh_tw: 我使用某某文件共享軟件時沒有貢獻什么，并且得到了更多實惠。

source: Do you get to do that anonymously? Freenet is designed with anonymity in mind, performance comes second.
zh_tw: 你知道嗎，這是為了匿名性。Freenet 的首要設計目標是匿名性，性能屈居第二。

source: All my friends donate very little space and bandwidth. Should I donate more?
zh_tw: 我的朋友捐贈很少的空間和流量，我是否該多捐一點？

source: If you are happy with what you are getting then no. But if you want more you should consider donating more and running your node as close to 24x7 as possible, and you should ask your friends to do the same.
zh_tw: 如果你滿意於你得到的，請選no，但如果你想要更多 你可以考慮多捐款一點，盡可能全天候地運行你的節點 你也請求你的朋友同樣這麼做。

source: If I donate a lot will my experience improve significantly?
zh_tw: 如果我貢獻很多，能顯著改善我的體驗嗎？

source: Your experience will definitely get better, but for a really great improvement we need more people to start thinking like you. Bandwidth counts more than diskspace.
zh_tw: 你的體驗肯定會更好，但對於一個顯著的改善，我們需要更多人開始這樣做。帶寬比磁槃空間更重要。

source: Is Freenet legal?
zh_tw: Freenet 合法嗎？

source: We don't currently know of any prosecutions for merely using Freenet. Some people claim that the [DADVSI](https://en.wikipedia.org/wiki/DADVSI) makes Freenet illegal in France; the German data retention law might have required logging, but [was struck down](http://en.wikipedia.org/wiki/Telecommunications_data_retention#Germany). Also, the German supreme court has found that [not securing your wifi properly](http://merlin.obs.coe.int/iris/2010/7/article13.en.html) makes you responsible for other people's downloads over it; this might or might not be extended to prohibiting anonymous peer to peer filesharing such as Freenet. [ACTA](http://en.wikipedia.org/wiki/ACTA) might have wide-ranging effects, including on Freenet, should it pass, and similar laws such as IPRED2 have been tried in the past. There have also been attempts to force peer to peer systems to provide wiretapping capabilities in the USA, and there are [worrying developments](http://www.bbc.co.uk/news/uk-politics-19968068) in the UK that might result in it being blocked, but not being made illegal per se. As far as we know none of these things - apart from the first two - have passed. Many of these are arguable either way (depending on how broadly the legislation is applied) and will have to be decided in caselaw. The law can be an ass sometimes. You can read the EFF's (US-centric) advice to peer to peer developers [here]( https://www.eff.org/wp/iaal-what-peer-peer-developers-need-know-about-copyright-law). If you need legal advice, talk to a lawyer. Also read the next section especially if you are in China; blocking the protocol may suggest the authorities don't like us!
zh_tw: 目前我們沒聽過任何僅因使用Freenet而導致的起訴。 有些人認為[DADVSI]( https://en.wikipedia.org/wiki/DADVSI )造成Freenet在法國違法； 德國的數據保留法是可能要求留下紀錄，但[已遭封殺] ( http://en.wikipedia.org/wiki/Telecommunications_data_retention#Germany )。 另外，德國最高法院知道[未妥善保護Wifi] ( http://merlin.obs.coe.int/iris/2010/7/article13.en.html ) 而使他人藉此下載，您將是負責人。這或許也或許不能引申至Freenet之類的P2P分享網路。 [反仿冒貿易協定]( http://en.wikipedia.org/wiki/ACTA )可能對Freenet法案通過有廣泛的影響，過去相似的法律如IPRED2已經努力嘗試過了。 美國也試圖脅迫P2P系統以取得竊聽能力。 而英國已有[值得擔憂的進展]( http://www.bbc.co.uk/news/uk-politics-19968068 )它不違法，但會被自身阻擋。 至目前為止，除了前兩項的其他法案都尚未通過。其中很多法案不論正反面都有待商榷(這取決於法律適用範圍的寬度)，而且也會參考判例。 法律可能會是個屁。您可以閱讀EFF(美國為主)對P2P開發者的[意見]( https://www.eff.org/wp/iaal-what-peer-peer-developers-need-know-about-copyright-law )。 若您需要法律諮詢，請找律師談談。 請閱讀下一章節，特別是若您在中國，阻止該協議可能暗示當局不喜歡我們！

source: Is Freenet blocked by national firewalls?
zh_tw: Freenet 被國家防火牆封鎖嗎？

source: The Chinese national firewall (Golden Shield) has blocked our website for many years, and was observed in 2005 to block the 0.5 protocol as well. This suggests China doesn't like us, so be careful if you run Freenet in China. Some other countries (e.g. France) are known to be hostile to peer to peer, and may eventually force ISPs to block peer to peer networks (but right now Freenet works fine in France and we have many French users!). Technically, Freenet 0.7 has some minimal defences against blocking; the protocol is relatively hard to identify (we are working on ["transport plugins"](https://wiki.freenetproject.org/Transport_plugins), which would [make it much harder to detect Freenet](http://en.wikipedia.org/wiki/Steganography). Freenet supports a [darknet](https://wiki.freenetproject.org/Darknet) mode (i.e. only connecting to your friends) which makes automated harvesting and blocking of nodes very difficult. Note that many mobile internet providers block all peer to peer networks along with other content, and many corporate or academic networks may block Freenet (but even if they don't, see [you shouldn't run Freenet at work](#trouble) for non-work purposes!).
zh_tw: 中國國家防火牆（金盾）多年以來一直阻擋我們的網站，而且在2005年發現也會阻擋0.5版協議。 這意味的中國不喜歡我們，所以在中國請小心使用Freenet。 有些其他國家（像法國）對P2P有敵意，而最終大多逼迫網路業者阻擋P2P網路。（不過現在Freenet在法國很正常也有很多用戶！） 從科技層面來說，Freenet0.7對網路阻擋只有最少的防禦；協議重點是較難被識別(我們致力於[轉移外掛](https://wiki.freenetproject.org/Transport_plugins)，能夠[更難偵測Freenet](http://en.wikipedia.org/wiki/Steganography)。Freenet支援[暗網](https://wiki.freenetproject.org/Darknet) 模式(就是僅與朋友連線)，造成自動獲取節點和攔截的困難。注意許多行動網路供應商把P2P網路從網路隔開，許多企業和學術網路也會阻擋Freenet(但即使他們不擋，也請[別在工作時使用Freenet](#麻煩)達成非工作相關的目的!)。

source: Can I get trouble if I run a node?
zh_tw: 我運行一個節點是否會帶來麻煩？

source: What about copyright?
zh_tw: 怎么對待版權？

source: There are some excellent thoughts on this subject on the [Philosophy]( about.html#philosophy) page. Specific copyright-related laws may be a problem, please read [Is Freenet legal?](#legal) and [Is Freenet blocked by national firewalls?](#blocked).
zh_tw: 這個主題上,(about.html#philosophy) 網頁上提供了優質的想法, 特別有關版權法令或許是個大問題,請參閱 [Is Freenet legal?](#legal) 以及 [Is Freenet blocked by national firewalls?](#blocked).

source: What about child porn, offensive content or terrorism?
zh_tw: 如何面對兒童色情、攻擊性內容，或者恐怖主義？

source: While most people wish that child pornography and terrorism did not exist, humanity should not be deprived of their freedom to communicate just because of how a very small number of people might use that freedom.
zh_tw: 當大多數人希望兒童色情與恐怖主義不曾存在 人性不應被剝奪其溝通的自由僅僅因為 少部份的人會利用這樣的自由
