Repository: Bombe/hyphanet-website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: ru, zh_tw

source: It is for this reason that Freenet, a system designed to protect Freedom of Speech, must prevent enforcement of copyright.
ru: Именно по этой причине Freenet, система, разработанная для защиты Свободы Слова, должна препятствовать контролю соблюдения авторских прав.

source: But how will artists be rewarded for their work without copyright?
ru: Но как люди творчества будут вознаграждены за свою работу без Копирайта?

source: Firstly, even if copyright were the only way that artists could be rewarded for their work, then I would contend that freedom is more important than having professional artists (those who claim that we would have no art do not understand creativity: people will always create, it is a compulsion, the only question is whether they can do it for a living).
ru: Во-первых, даже если авторское право было единственным способом получить вознаграждение за свою работу, я бы сказал, что свобода важнее профессионального творчества (те, кто утверждают, что у нас не будет искусства, не понимают творчества: люди всегда будут создавать, это компульсивное желание, вопрос только в том, смогут ли они этим зарабатывать на жизнь).

source: Secondly, it could be questioned whether copyright is effective even now. The music industry is one of the most vocally opposed to enhancements in communication technology, yet according to many of the artists who should be rewarded by copyright, it is failing to do so. Rather it has allowed middle-men to gain control over the mechanisms of distribution, to the detriment of both artists and the public.
ru: Во-вторых эффективность Копирайта сомнительна даже сейчас. Музыкальная индустрия наиболее заметно выступает против улучшений в коммуникационных технологиях, тем не менее по мнению многих артистов, которым Копирайт должен приносить доход, он не работает. Скорее это позволило посредникам получить контроль над механизмами дистрибуции, в ущерб как художникам, так и общественности.

source: Alternatives to Copyright
ru: Альтернативы копирайту

source: Fortunately it won't come to this. There are many alternative ways to reward artists. The simplest is voluntary payment. This is an extension of the patronage system which was frequently used to reward artists prior to copyright, where a wealthy person would fund an artist to allow them to create full-time. The Internet permits an interesting extension of this idea, where rather than having just one wealthy patron, you could have hundreds of thousands, contributing small amounts of money over the Internet.
ru: К счастью, до этого не дойдет. Есть много альтернативных способов вознаграждения артистов. Самым простым является добровольный платеж. Это продолжение системы патронажа, которая часто использовалась для вознаграждения художников до авторского права, когда богатый человек финансировал артиста, чтобы позволить им творить на постоянной основе. Интернет дает возможность продления этой идеи, когда вместо одного источника финансовой поддержки, вы могли бы иметь сотни тысяч, которые вкладывают небольшие суммы денег через Интернет.

source: We actually practice what we preach in this regard too, on the 15th of March 2001 the Freenet Project started taking donations, and within a week we had collected over $1000.
ru: Собственно говоря мы также практикуем это, 15 марта 2001 года проект Freenet начал принимать пожертвования, и в течение недели мы собрали более 1000 долларов.

source: Current Contributors
ru: Главные участники проекта на сегодняшний день

source: Freenet is based on Ian's paper "A Distributed Decentralised Information Storage and Retrieval System". Ian started the Freenet Project around July of 1999, and continues to coordinate the project. Learn more about Ian on his <a href="http://blog.locut.us/">personal website</a>.
ru: Проект Freenet основан на работе Яна "Распределенная децентрализованная система хранения и поиска информации". Ян начал проект Freenet примерно в июле 1999 года и продолжает его координировать. Узнайте больше об Яне на его <a href="http://blog.locut.us/">личном сайте</a>.

source: Matthew has been working on Freenet since before the 0.5 release. His work and that of others has resulted in dramatic improvements to the performance and stability of the network.
ru: Мэтью работал над Freenet еще до выхода 0.5. Его и работа других разработчиков привела к значительному улучшению производительности и стабильности сети.

source: Oskar was also one of the earliest contributors to the Freenet Project, and has made some important theoretical breakthroughs that lead to the beginning of Freenet 0.7, see the papers page.
ru: Оскар также был одним из первых авторов проекта Freenet, и сделал несколько важных теоретических прорывов, которые привели к началу Freenet 0.7, смотрите Страницу с документами.

source: Since 2003, Florent has improved various aspects of the software and performed the project's system administration. In his day job, he is the Technical Director of <a href="https://www.trustmatta.com">Matta Consulting</a>, a boutique security consultancy firm and currently works on <a href="https://safepass.me">safepass.me</a>, an Active Directory password filter.
ru: С 2003 года Флорент улучшил различные аспекты программного обеспечения и проводил его системное администрирование. На основной работе он занимает должность технического директора консалтинговой фирмы по безопасности <a href="https://www.trustmatta.com">Matta Consulting</a> и в настоящее время работает над <a href="https://safepass.me">safepass.me</a> - фильтром паролей Active Directory.

source: Michael has mostly contributed detailed simulations as part of the Google Summer of Code. He has been helpful in designing the <a href="https://old-wiki.freenetproject.org/NewTransportLayer">new transport layer</a>.
ru: Майкл в основном участвовал в создании подробных симуляций в рамках инициатив программы компании Google, Google Summer of Code. Он помог в разработке <a href="https://old-wiki.freenetproject.org/NewTransportLayer">нового транспортного уровня</a>.

source: The current release manager. He joined in GSoC 2013 and has been a driving force behind tackling long standing issues in Freenet.
ru: Текущий релиз менеджер. Он присоединился к GSoC 2013 и был движущей силой в решении давних проблем в Freenet.

source: The Developer of the Web of Trust and Freetalk. He worked on the Web of Trust in part-time for one year and is now working as volunteer again.
ru: Разработчик плагина Web of Trust и Freetalk. Он работал над Web of Trust в режиме не полного рабочего дня в течение одного года и теперь снова работает волонтером.

source: The developer of the site insertion tool jSite and of Sone, the Social Network over Freenet.
ru: Разработчик инструмента jSite для создания сайтов и социальной сети Sone во Freenet.

source: A debian developer who currently works on packaging Freenet.
ru: Разработчик операционной системы Debian, который в настоящее время работает над сборкой Freenet.

source: Works on the Freenet core and wherever there is need.
ru: Работает над основной частью Freenet и везде, где это необходимо.

source: A long term contributor who, among other things, helps keep the contact between the core developers and users in active subgroups.
ru: Является соавтором Freenet на протяжении длительного времени, который, кроме этого, помогает поддерживать связь между основными разработчиками и пользователями в активных группах.

source: A Gentoo packager who untangled all the dependencies of Freenet and packaged it cleanly in Gentoo.
ru: Упаковщик ОС Gentoo, который распутал все зависимости Freenet и аккуратно упаковал его в Gentoo.

source: The current maintainer of pyFreenet and infocalypse. He also writes articles and tutorials for Freenet.
ru: Занимается поддержкой pyFreenet и infocalypse. Он также пишет статьи и учебные пособия для Freenet.
