Repository: Bombe/hyphanet-website
Catalog: locales/*/LC_MESSAGES/freenet_site.po
Languages: ru, zh_tw

source: ### Fproxy Connecting peer nodes with FProxy can be done in several ways. Common for all these are that they are all done under the **Darknet** menu item or using the [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) link. Below is the thing that makes it all happen: ![](assets/img/add_peers.png) As you can see, there are three ways of getting a node reference from someone else: * Pasting it "as is", in the top field, * a URL pointing at the reference, or * a file, containing the reference. [http://dark-code.bulix.org/](http://dark-code.bulix.org/) is a so called **paste-bin**, where you can add your node reference, make sure that the **private** box is checked, and press **Paste**. The paste-bin then returns an URL (e.g. http://dark-code.bulix.org/yuf01h-34676?raw), which can be shared with others. Make sure that you add **?raw** to the link. This makes the link point only to the actual pasted data, with no extra design elements. Your own Freenet reference can be found on the [ http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) page, under the caption **My Node Reference**. It might look something like this (cut to fit on the screen):
zh_tw: ### Fproxy 在 FProxy 中與好友節點建立連接有幾種方式。最常見的方式是進入「朋友”選單或直接訪問 [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) 鏈接。然后您就可以找到下面的框添加好友了： ![](assets/img/add_peers.png) 如您所見，有三種方式添加好友的節點信息： * 直接將節點信息粘貼到那個大的輸入框， * 輸入節點信息的 URL，或， * 上傳節點信息文件。 [http://dark-code.bulix.org/](http://dark-code.bulix.org/) 網站被稱為 **Paste-bin**，您可以將自己的節點信息複制粘貼到那個網站，選中“**private**”框，然后點擊 **Paste** 按鈕。 Paste-bin 便會返回一個網址 (如：http://dark-code.bulix.org/yuf01h-34676?raw)，您可以將這個網址分享給自己的好友。請記得在網址后添加 **?raw**。添加後這個網址只會原封不動下載您的節點信息，而不會添加其他信息。 您自己的 Freenet 節點信息可以在 [http://127.0.0.1:8888/friends/](http://127.0.0.1:8888/friends/) 朋友頁面中“**我的節點信息**”一欄找到，它看上去如下圖(因為頁面寬度有限，內容做了裁剪):

source: Remember that both you and the node you are connecting to must add references to make the connection work. This means that if you add a persons node reference on your side, but that person does not add your reference on his/her side, the connection **does not work**.
zh_tw: 請記得您和您的好友必須都互相添加了對方的節點信息，你們才能互相連接。也就是說，如果您添加了某位好友的節點信息，但是他未添加您的節點信息，你們倆是**連不上的**。

source: ### Darknet peers When you have a number of connections, you can visit the Darknet page. It should look something like this: ![](assets/img/Freenet-darknet_peers.png) There are a number of status messages that can be seen here: * CONNECTED - the node is connected and ready to take your request * BACKED OFF - the node is choked with traffic and unable to respond * DISCONNECTED - the node is not connected to your node, and probably turned off * NEVER CONNECTED - the connection between the nodes has not been established. This can be because of firewall problems/restrictions, one side not adding the other sides node reference or that the nodes have not been online at the same time yet in order to confirm the connection. If the problem persists over a long time and both sides have added each other, try to redo the connection. In the Idle column, you can see how much time has passed since the last status message.
zh_tw: ### 暗網節點 當您有了一定數量的好友連接時，您可以造訪暗網。如下圖： ![](assets/img/Freenet-darknet_peers.png) 這裡可能看到幾個狀態信息： * 已連接 - 節點已經連接，準備好接受您的請求 * 暫不接受 - 節點十分繁忙，無法響應 * 已斷開 - 節點當前未連接到您的節點，而且可能已經關閉 * 從未連接 - 兩個節點間的連接從未建立。 這可能是因為防火牆的限制/設定問題，或是一方沒有添加另一方的節點信息，或是那些節點在當時還未上線來確認連接。如果問題長時間，嘗試重新建立連接。 在「空嫌”那列，您可以看到自轉換到上一個狀態以來，經過了多長時間。

source: Content
zh_tw: 內容

source: In addition to its anonymity features, as a content distribution network Freenet has the following strengths: * **Totally decentralized** Information can be inserted into Freenet for download without any reliance on a centralized server. All the inserter needs to do is give the content's "key" to someone else and they will be able to download it. * **Adaptive caching** Many CDN architectures only allow peers which have already downloaded a file to share it with other peers. Freenet will adaptively cache information on peers as necessary to meet demand regardless of what that peer has downloaded. This allows Freenet to "scale-up" much more quickly than most solutions for popular files, and improves load-balancing. * **Strong Security** Freenet has long-supported the concept of "Content Hash Keys" which guarantee the integrity of retrieved data. This approach has since been adopted by other architectures. Freenet also supports "Signed Subspace Keys" which allow content to be digitally signed. This also allows content integrity to be guaranteed, but is more flexible than CHKs. * **Forward Error Correction** In common with some other CDN architectures, Freenet employs "Forward Error Correction", which allows a file to be reconstructed even if some of the parts of that file can't be retrieved. Uniquely, Freenet also supports "healing", which involves the reconstruction and reinsertion of missing file components. This page contains links to freely available content on Freenet. If you would like to add a new link please email it to [us]( https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support) - remember that we will only link to content that can be legally distributed in the United States of America.
zh_tw: 除了匿名功能外，作為一個分散式內容網路，Freenet 還有如下優點： * **完全去中心化** 內容可以插入到 Freenet 以供他人下載，無需中心伺服器。插入後，只需要將內容的“鍵值”提供給他人，他人便可下載該內容。 * **自適應快取** 許多 CDN 架構只允許已經下載了某個檔案的節點將這個檔案共享給其他節點。Freenet 節點則會在需要時自適應快取資料，無論該節點是否已下載該資料。這個特性讓 Freenet 可以比常規解決方案更快的傳播流行檔案，並改善了負載均衡。 * **強健的安全性** Freenet 很久以前就已支援“內容雜湊鍵值（Content Hash Keys）”，保證了接受到的數據的完整性。此方式後來被其他應用程式和架構借用。Freenet 也支援“已簽名子空間鍵值（Signed Subspace Keys）”，可以對內容數字簽名。這種方式也能保證資料的完整性，且比 CHK 更加靈活。 * **前向糾錯** 與其他 CDN 架構類似，Freenet 引入了“前向糾錯（Forward Error Correction）”機制，這樣即使在檔案的某些部分無法獲取時，檔案也可以被正確重建。Freenet 還有一個獨特的特性：“恢復（healing）”，在需要時可以重建和自動插入丟失的檔案資料。 本頁包含了一些 Freenet 上廣泛可用的內容。如果您想將連線新增進來，可以[發郵件給我們]( https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support) - 請注意我們僅會新增那些符合美國法律的連結。

source: Understand
zh_tw: 原理

source: Freenet can be thought of as a large storage device. When you store a file in it, you receive a key which can be used to retrieve the file. When you supply Freenet with a key, it returns the appropriate file (if it is located). The storage space is distributed among all connected nodes on Freenet. Freenet is a peer-to-peer network which is both decentralized and anonymized. The nodes that you connect to only know their nearest neighbours and have no idea about how the network as a whole is structured.
zh_tw: Freenet 可被看作為一個大型的數據存儲設備。當您將文件儲存其中時，您會得到一個鍵值。在您將某個鍵值提供給 Freenet 時，它會下載鍵值對應的文件(如果文件存在)。這個存儲設備的存儲空間分布在所有的 Freenet 節點中。 Freenet 是一個點對點的網絡，去中心化且匿名。您連接的節點僅會知道其最近的鄰居，對整個網絡的組成結搆是不知道的。

source: ### Small world network Freenet is built on the principle of small world networks. By connecting to nodes of people you already know, and the people you know in turn connect to people they know, one should be able to reach all nodes in a Freenet network.
zh_tw: ### 小世界網絡 Freenet 基於「小世界網絡”的理論搆建。您只連接到自己認識的人的節點，而其他人也只連接到自己認識的人的節點，那麼所有人都可以訪問所有節點的數據。

source: ### The datastore All Freenet nodes contribute a part of their hard drive space to store encrypted pieces of files. They are stored in the **datastore** directory in the Freenet installation directory.
zh_tw: ### 數據存儲 所有 Freenet 節點都會貢獻自己硬碟的一部分空間來儲存加密文件數據。這些文件是加密儲存在 Freenet 安裝目錄下的 **datastore** 目錄中。

source: Unlike other peer-to-peer networks, you as a user have little or no control over what is stored in your datastore. Instead, files are kept or deleted depending on how popular they are. This allows Freenet to be censorship-resistant. There is no "delete file" operation.
zh_tw: 與其他點對點網絡不同，作為一個用戶，您無法控制儲存在您的”數據存儲「中的內容。事實上，文件是根據它們的流行程度來自動保留或刪除的。這是為了保證 Freenet 無法被審查者刪除，故無刪除檔案的選項。

source: It is hard, but not impossible, to determine what the encrypted file pieces stored in your local Freenet datastore are part of. This allows plausible deniability.
zh_tw: 確認本機Freenet資料庫的加密文件，很難卻尚有可能。 這允許看似合理的推諉。

source: Freenet suggests an initial size based on how much space is available, and you can change the store size at any time. A larger store uses more RAM, but makes for better browsing for you and helps Freenet as a whole.
zh_tw: 我們建議您根據自己的硬碟可用空間大小合理的設置 Freenet 數據存儲的大小。您可以在以后隨時更改它。更大的存儲需要更多的內存，但是這能夠讓您更好的瀏覽 Freenet，同時也為整個 Freenet 作出了貢獻。

source: ### Freenet Routing Initially, each node has no information about the performance of the other nodes it knows about. This means that routing of requests is essentially random. But since different nodes have different randomness, they will disagree about where to send a request, given a key. So the data in a newly-started Freenet will be distributed somewhat randomly.
zh_tw: ### Freenet 路由 起初，每個節點都不了解它所知的其他節點的有關性能的信息。這意味着對請求的路由是隨機的。但由於不同的節點都有不同的隨機性，有些會拒絕對某個鍵值的請求。因此新啟動的 Freenet 會被隨機分布在某個位置。

source: As more documents are inserted by the same node, they will begin to cluster with data items whose keys (see below) are similar, because the same routing rules are used for all of them. More importantly, as data items and requests from different nodes "cross paths", they will begin to share clustering information as well.
zh_tw: 隨着越來越多的數據被相同的節點插入，鍵值類似（參見下文）的數據將自動聚合起來，因為同樣的路由規則對所有這些數據都是有效的。更重要的是，因為來自不同節點的數據內容和請求跨路徑傳輸，節點便互相開始分享這些聚合信息。

source: The result is that the network will self-organize into a distributed, clustered structure where nodes tend to hold data items that are close together in key space. There will probably be multiple such clusters throughout the network, any given document being replicated numerous times, depending on how much it is used.
zh_tw: 結果是整個網絡會自我組織為一個分布式、聚合的結搆，節點會趨向於儲存鍵值空間接近的的數據。網絡中可能有多個類似的聚合，根據數據的使用頻率，數據會被重復儲存多次。

source: ### Freenet keys Each file that exists on Freenet has a key associated with it. Freenet 0.7 has various types of keys. Keys are used for everything on Freenet, and are a kind of [URI](https://en.wikipedia.org/wiki/Uniform_Resource_Identifier) ( e.g. freenet:=KSK@sample.txt).
zh_tw: ### Freenet 鍵值 Freenet 網路中的每個檔案都有一個鍵值。Freenet 0.7 的鍵值有數種類型。Freenet 網路的一切都在使用鍵值，鍵值是 [URI](https://en.wikipedia.org/wiki/Uniform_Resource_Identifier) ( e.g. freenet:=KSK@sample.txt)（統一資源識別符號）的一種。

source: Most keys are hashes: there is no notion of semantic closeness when speaking of key closeness. Therefore there will be no correlation between key closeness and similar popularity of data as there might be if keys did exhibit some semantic meaning, thus avoiding bottlenecks caused by popular subjects.
zh_tw: 大部分的鍵值都是哈希值：我們在說鍵值比較接近，不是指它們在人可以看懂的那一部分比較接近。即使兩個鍵值人能看懂的部分是一致的，鍵值接近和數據流行的相似程度間也沒有直接的關系。兩個語義相同的鍵值可以是不同的內容。這就避免了某個流行話題的相關數據太多，鍵值不夠用的情況。

source: ### Accessing data To access a particular piece of data on Freenet, you can use FProxy. You need to know the key to the data, and enter it like this (or click a link containing the key): <pre> http://localhost:8888/[Freenet Key]</pre> There are four types of keys in Freenet: * **CHK** - Content Hash Keys * **SSK** - Signed Subspace Keys * **USK** - Updatable Subspace Keys * **KSK** - Keyword Signed Keys
zh_tw: ### 訪問資料 要訪問 Freenet 上的資料，您可以使用 FProxy。您需要知道資料的鍵值，並使用如下網址訪問（或者點選包含該鍵值的連結）： <pre> http://localhost:8888/[Freenet 鍵值]</pre> Freenet 中有 4 種不同型別的鍵值： * **CHK**：內容哈希<!--雜湊-->鍵值 * **SSK**：已簽名子空間鍵值 * **USK**：可更新子空間鍵值 * **KSK**：關鍵詞簽名鍵值

source: CHKs are the most fundamental. All files over 1kB are ultimately divided into one or more 32kB CHKs. CHKs' filenames are determined only by their contents. SSKs are the other basic type. These combine a public key with a human-readable filename and therefore allow for freesites. KSKs are a variant of SSKs where everything is determined by a simple human readable filename ( e.g. =KSK@sample.txt). These are spammable but convenient in some cases. And USKs are a form of updatable keys especially useful for freesites and **Address Resolution Keys**.
zh_tw: CHK 是最基礎的。所有超過 1kB 的文件最終都會分割到一或多個 32kB 的 CHK 中。CHK 的文件名只根據它們的內容決定。SSK 是另外一種基本類型。它們是由一個公鑰和一個人可讀的文件名組合起來的，因此支持 Freesite 網站。KSK 是 SSK 的變種，其鍵值僅根據人可讀的文件名（例如 =KSK@sample.txt）來決定。KSK 容易被垃圾信息騷擾，但是在某些情況下會比較方便。USK 是可更新的鍵值，對 Freesite 和**地址解析鍵值**（Address Resolution Key）特別有用。

source: An Address Resolution Key (ARK) is an Updatable Subspace Key (USK) inserted by the node whenever its IP address changes. It contains the reference for the node - its cryptographic details, and in particular its IP address(es). ARKs are a way to help people connect to Freenet if they have problems caused by firewalls, routers or changing IP addresses. If someone cannot accept incoming traffic it can make it difficult to connect. ARKs are an implementation detail and you don't need to know anything about them to use Freenet.
zh_tw: 地址解析鍵值 (ARK) 是一個可更新子空間鍵值 (USK)。節點在其 IP 地址改變後會自動插入該鍵值。它包含了節點的資訊，包括加密細節和新的 IP 地址。在出現防火牆、路由的問題，或 IP 地址改變時，ARK 可以幫助人們連線到 Freenet。如果某人無法接收他人的傳入連線，ARK 能幫得上忙。 ARK 是一個實現的細節，日常使用 Freenet 時您不需要了解它。

source: ### Content Hash Keys Content Hash Keys are for files with static content, like an .mp3 or a PDF-document. These keys are hashes of the content of the file. A hash is a reproducible method of turning a specific piece of data into a relatively small number that serve as a sort of *fingerprint* for the data. If the file content changes, even ever so little, the hash of the file changes radically. This makes the data hard to tamper with without anyone noticing. A CHK uniquely identifies a file, it should not be possible for two files with different content to have the same CHK. The CHK consists of three parts: 1. the hash for the file 2. the decryption key that unlocks the file, and 3. the cryptographic settings used
zh_tw: ### 內容哈希鍵值（Content Hash Keys，CHK） 內容哈希鍵值（CHK）可以用在靜態內容文件上，比如 .mp3 或 PDF 文檔。鍵值是文件內容的哈希值。 哈希值是將特定的數據根據一定的算法計算出來的相對較短的「指紋”，同一數據每次生成的哈希值一定是相同的。如果文件內容改變，即使只是改變了一點點，文件的哈希值也會變化。這樣如果數據被篡改，人們就會注意到。一個 CHK 鍵值指向一個唯一的文件。兩個不同內容的文件不可能有相同的 CHK。CHK 由 3 部分組成： 1. 文件的哈希值， 2. 用於解鎖文件的解密密鑰， 3. 文件的加密方式。

source: A typical CHK key looks like this: CHK@file hash,decryption key,crypto settings or for example: CHK@SVbD9~HM5nzf3AX4yFCBc-A4dhNUF5DPJZLL5NX5Brs,bA7qLNJR7IXRKn6uS5PAySjIM6azPFvK~18kSi6bbNQ,AAEA--8 The decryption key is part of the key for the file, and is not included in requests for the file's pieces. It is thus not possible to decrypt the file without the CHK key. To access the file, the whole key must be pasted behind the FProxy address (cut to fit screen): http://localhost:8888/CHK@SVbD9~[..]X5Brs,bA7qLN[..]Si6bbNQ,AAEA--8
zh_tw: 一個典型的 CHK 格式如下： CHK@檔案雜湊值,解密金鑰,加密方式設定 示例： CHK@SVbD9~HM5nzf3AX4yFCBc-A4dhNUF5DPJZLL5NX5Brs,bA7qLNJR7IXRKn6uS5PAySjIM6azPFvK~18kSi6bbNQ,AAEA--8 解密金鑰是該檔案金鑰的一部分，並且不會包含在對檔案片段的請求中，因此不可能在沒有 CHK 鍵值的情況下解密檔案。 要訪問檔案，您需要將整個鍵值都貼上到 FProxy 網址後（下面的示例已截短以適配頁面寬度）： http://localhost:8888/CHK@SVbD9~[..]X5Brs,bA7qLN[..]Si6bbNQ,AAEA--8

source: ### Signed Subspace Keys Signed Subspace Keys are usually for sites that are going to change over time. For example, a website that may need news to be updated or information to be corrected, added or deleted. They work in such a way that someone else can't put up a newer version of your site and pretend it was you who did it. It works by using public-key cryptography so you can sign your site. Only the person with the secret key can add updated versions of your site to Freenet.
zh_tw: ### 已簽名子空間鍵值（Signed Subspace Keys，SSK） 已簽名子空間鍵值（SSK）通常用在經常更新的網站上。網站一般需要更新新聞，添加、刪除或修正內容。SSK 的作用就是讓除了網站擁有者外的其他人無法自己做一個新版本，然后冒充是網站擁有者做的。 它使用公鑰加密方式，因此您可以為自己的網站簽名。只有擁有密鑰的人才能在 Freenet 上更新網站。

source: Also the SSK consists of five parts: * **public key hash** - This part is all that is required to uniquely identify the file (but not decrypt it), so nodes need only store this bit. The actual public key is stored (unencrypted) with the (encrypted) data. * **document decryption key** - This is only known to clients and not to the nodes storing the data, so nodes cannot decrypt the data they store without the full address. * **crypto settings** - Cryptographic algorithm used, etc. * **user selected name** - a word or sentence chosen by the site author. * **version** - the current version of the site. The version number is increased each time a new version of the site is created and inserted into Freenet. This approach is used since it is not currently possible to update already inserted data in Freenet. Updateable Subspace Keys makes this more transparent to the user, see below. A typical SSK key looks like this: SSK@public key hash,decryption key,crypto settings/user selected name-version For example (cut for screen purposes): SSK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite-4
zh_tw: SSK 由 5 部分組成： * **公鑰哈希值** - 只需要這一部分，就可以識別一個唯一的文件（但不使用它加密文件），因此節點只需儲存這一部分。完整的公鑰是（未加密）和（加密的）數據儲存在一起的。 * **文檔解密密鑰** - 只有上傳文件的客戶端知道此密鑰，而儲存數據的節點并不知道。因此，如果節點不知道文件的完整網址，它便無法解密數據。 * **加密方式設置** - 使用的加密算法等。 * **用戶指定的名稱** - 網站作者指定的一個單詞或句子。 * **版本** - 網站當前的版本。 每次當新版本的網站被創建并插入到 Freenet 時，版本號便會增加。因為當前無法在 Freenet 上更新已插入的數據，因此我們釆用了這種方式。可更新子空間鍵值（Updateable Subspace Key，USK）讓其對用戶更加透明。參見下文。 典型的 SSK 鍵值格式如下： SSK@公鑰哈希值,解密密鑰,加密方式設置/用戶指定的名稱-版本 示例（截短以適配頁面寬度）: SSK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite-4

source: ### How Signed Subspace Keys work * The author generates a cryptographic keypair: a **private key** for signing files and a **public key** for verifying the signature. * The author also generates a single **symmetric key** (one that is used for both encrypting and decrypting). * When a file is inserted into Freenet, it is encrypted with the **symmetric key** and signed with the **private key**. The signature is stored with the file. Nodes don't store the **symmetric key**, only the **public key** part of the SSK, as an index to the data. This is so they can plausibly deny knowledge of the data on their node. The SSK is made up of a hash of the public key, and the symmetric key. The hash of the public key acts as the index to the data for searching purposes. Also, the actual public key is stored with the data. This is so that Freenet nodes can verify the signature when the SSK file comes into their node, and also so that clients can verify the signature when retrieving the file. The symmetric key is so that clients can decrypt the file. Signed Subspace Key sites have largely been superseded by Updatable Subspace Key (USK) sites, which are based on SSKs but allow for links that try to always retrieve the most up-to-date version of the site.
zh_tw: ### 已簽名子空間鍵值（SSK）是如何工作的 * 文件擁有者生成一對加密密鑰：**私鑰**用來對文件簽名，**公鑰**用來驗證簽名。 * 文件擁有者還會生成一個**對稱密鑰**（同時用於加密和解密）。 * 當某個文件插入到 Freenet 時，它會使用**對稱密鑰**加密，使用**私鑰**簽名。簽名是和文件一同存儲的。節點不儲存**對稱密鑰**，僅儲存 SSK 的**公鑰**部分，用於索引數據。這樣用戶可以推脫不知道自己節點到底存儲了哪些內容。 SSK 是由公鑰的哈希值和對稱密鑰組成的。公鑰的哈希值用於索引數據，方便搜索。真正的公鑰是和數據一同儲存的。這樣當某個 SSK 代表的文件上傳到 Freenet 節點時，它可以驗證文件的簽名。另外當其他節點下載這個文件時，也可以驗證其簽名。其他節點還使用對稱密鑰解密文件。 已簽名子空間鍵值（SSK）網站最近已經被可更新子空間鍵值（USK）網站取代。USK 基於 SSK，但是可以提供可自動更新的網址鏈接，隨時接收最新版本的網站。

source: ### Updateable Subspace Keys Updateable Subspace Keys are useful for linking to the latest version of a Signed Subspace Key (SSK) site. Note that USKs are really just a user-friendly wrapper around SSKs, which hide the process of searching for more recent versions of a site. A typical USK key looks like this: USK@public key hash,decryption key,crypto settings/user selected name/number/ It is almost identical to the Signed Subspace Key, with the exception of the version-number. There are two types of USK addresses: * an USK with a positive number at the end, or * an USK with a negative number at the end.
zh_tw: ### 可更新子空間鍵值（Updateable Subspace Keys，USK） 可更新子空間鍵值（USK）用於鏈接到最新版本的已簽名子空間鍵值（SSK）網站。其實 USK 只是對 SSK 的一個包裝，使其更人性化，隱藏了搜索最新版網站的過程。 典型的 USK 鍵值格式如下： USK@公鑰哈希值,解密密鑰,加密方式設置/用戶指定的名稱/版本/ 它和 SSK 的格式基本一致，除了末尾的版本號。USK 地址有兩種類型： * USK 末尾的版本號是個正數，或 * USK 末尾的版本號是個負數。

source: The USK with a **positive** number at the end works like this: the Freenet node on your computer keeps a list of versions of USKs that it knows about, without necessarily storing the data as well. This list is built up from previous visits, and also background requests from previous visits to these kind of links. When you visit an USK like the one below, it consults this list for versions of the mysite site of number 5 or greater. If it finds any, it return the latest one. Then, in the background, it searches for **newer** versions that it doesn't yet know about to add to your USK registry for the next time you visit the address. Example (cut for screen purposes): USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite/5/
zh_tw: 末尾版本號是**正數**的 USK 的工作方式如下：您的 Freenet 節點儲存了它所知的 USK 的版本號列表，而并不儲存所有的數據。該列表在上一次訪問該網站的時候被創建，并在后台嘗試請求它們。當您訪問如下的 USK 網址，它會從列表中查詢是否有版本 5 或更高版本的 mysite 網站。如果找到新版本的網站，則直接返回最新版本的網站。然后，在后台，它會繼續搜索未知的**更新**的版本并添加到您的 USK 注冊表中，以供您下次訪問該網址時使用。 示例（截短以適配頁面寬度）： USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite/5/

source: When you visit a link with a **negative** number at the end, Freenet searches for the version you requested (e.g. **-7**) plus four more (i.e. 7,8,9,10, 11) at the node on your computer and on other nodes. If it finds only version 7, it will return that. If it finds one of the others, it searches for another batch of five versions: 12,13,14,15,16\. It repeats this until there are four consecutive versions it can't find. Then it will return the latest version it has found so far. Example (cut for screen purposes): USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite/-7/ The real treat with USKs comes when data is to be inserted into Freenet. But more on that elsewhere.
zh_tw: 當您訪問一個末尾為**負數**版本號的 USK 網址時，Freenet 會在您自己的節點以及其他節點搜索您請求的版本號（例如：**-7**），以及往后 4 個版本（也就是：7,8,9,10,11）。如果它只找到了版本 7，那么就直接返回它。如果它找到了另外四個版本中的任何一個，它會繼續搜索接下來一批 5 個版本：12,13,14,15,16。它會繼續搜索，直到最后連續 4 個版本都無法找到。然后它會返回找到的最新版本。 示例（截短以適配頁面寬度）： USK@GB3wuHmt[..]o-eHK35w,c63EzO7u[..]3YDduXDs,AQABAAE/mysite/-7/ 在插入數據到 Freenet 時，USK 最方便。當然它的方便還體現在其他一些地方。

source: ### Keyword Signed Keys Keyword-Signed Keys (KSKs) allow you to save named pages in Freenet. They are not secure against spamming or name hijacking. Several people could each insert a different file to Freenet, all with the same address. However, there is a collision detection, which tries to prevent overwriting of a once-inserted page. A KSK address looks like this: KSK@myfile.txt The drawback to KSKs is that anyone can insert a file with the same name as yours and divert traffic from your file to their own. The advantage is human readable links that can be easily remembered. The KSK description should not contain slashes, just as with other keys ( slashes are used to denote Manifests or Containers). A KSK address can contain a redirection to a CHK address, or it can contain the file itself.
zh_tw: ### 關鍵詞簽名鍵值（Keyword Signed Keys，KSK） 關鍵詞簽名鍵值（KSK）允許您在 Freenet 上保存有名字的網頁。它們不是足夠安全，無法抵御垃圾信息攻擊或名稱劫持。几個人可以插入不同的文件到 Freenet，但是都使用相同的網址。但是，Freenet 有沖突偵測機制，會嘗試避免覆蓋已插入的頁面。KSK 地址格式如下： KSK@myfile.txt KSK 的缺點是任何人都可以插入與您相同名稱的文件，將您的文件的流量轉移給它們。優點是它很容易看懂，人們很容易記下來。 KSK 鍵值和其他鍵值一樣，不應該包含斜杠（斜杠用來表示 Manifest 或容器）。 KSK 地址可以包含一個重定向，指向一個 CHK 地址。它也可以自己包含文件。

source: ### Containers A container, in general Freenet terms, is a file that contains several other files. In Freenet 0.7, a freesite, or other collection of files, may be bundled together in a ZIP file, which is limited in size to 2MB. Containers have the advantage that when you load one page you load all the files on the freesite, so either it loads in its entirety or it doesn't load at all, and greatly reduce the number of keys required to insert a given freesite. Containers are currently created transparently when inserting a freesite using e.g. jSite.
zh_tw: ### 容器 “容器”，在 Freenet 術語中是指一個包含多個其他檔案的檔案。在 Freenet 0.7 中，Freesite 或其他檔案集合，可被打包在一個 ZIP 檔案中，檔案大小限制為 2MB。容器的優點是當您載入一個頁面時，您其實載入了該頁面所在 Freesite 的所有檔案。這樣要麼整個網站都被載入，要麼都不載入。它也減少了插入 Freesite 所需的鍵值數量。在使用 jSite 等工具插入 Freesite 時，使用者基本上不會注意到容器的存在。
